[
  {
    "id": "55681243",
    "guid": "https://cryptopotato.com/?p=1422955",
    "published_on": 1765533665,
    "imageurl": "https://resources.cryptocompare.com/news/27/55681243.jpeg",
    "title": "Ethereum Price Analysis: Can ETH Challenge $3.4K Again or Is a Drop Below $3K Looming?",
    "url": "https://cryptopotato.com/ethereum-price-analysis-can-eth-challenge-3-4k-again-or-is-a-drop-below-3k-looming/",
    "source": "cryptopotato",
    "body": "ETH had a short-term push above the trendline and tested the $3,400 resistance, but the bounce quickly faded. The market is showing signs of exhaustion again, and bulls are struggling to maintain control. Unless stronger momentum steps in, Ethereum may be at risk of rolling back into the range. Technical Analysis By Shayan The Daily Chart After breaking above the descending trendline, ETH tapped into the $3,400–$3,500 resistance zone but failed to sustain higher prices. The asset is still trading below the 100-day and 200-day moving averages, both located above the $3,500 mark, and despite flipping the trendline, the structure remains fragile. The recent candle shows rejection from the same zone that capped the price in early November, making this a clear short-term barrier. If buyers lose grip, the next potential support is around the $2,900 bullish order block, which coincides with the broken trendline at the moment. The 4-Hour Chart On the 4-hour chart, it is evident that the breakout above the bearish trendline was clean, but the price faced immediate resistance near $3,400 and dropped back below $3,300. The previous resistance has now turned into a minor support zone around $3,100–$3,200. However, the rejection wick from the recent top shows a lack of follow-through. If this support fails, the price could revisit the $2,950–$2,900 range. Structure remains vulnerable, and RSI is cooling off after overbought conditions, suggesting weakening momentum. Sentiment Analysis Open Interest Open Interest is gradually rising again and sits near $19.4B, while the price has bounced back to around $3.2K. The last time this combo was seen, rising OI with flat or correcting price, it preceded a sharp move. This could go either way, but historically, when OI climbs faster than price, it signals aggressive speculative positioning, often followed by liquidations. Therefore, traders should stay cautious here as the risk of a flush is not off the table, especially if spot market demand doesn’t follow. The post Ethereum Price Analysis: Can ETH Challenge $3.4K Again or Is a Drop Below $3K Looming? appeared first on CryptoPotato .",
    "tags": "Crypto News|ETH Analysis|ETHBTC|ETHUSD|Ethereum (ETH) Price",
    "categories": "ETH|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Crypto Potato",
      "img": "https://images.cryptocompare.com/news/default/cryptopotato.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55681238",
    "guid": "https://cryptopotato.com/?p=1423037",
    "published_on": 1765533623,
    "imageurl": "https://resources.cryptocompare.com/news/27/55681238.jpeg",
    "title": "Major PI News: Pi Network Breaks Silence With Long-Awaited Winner Announcement",
    "url": "https://cryptopotato.com/major-pi-news-pi-network-breaks-silence-with-long-awaited-winner-announcement/",
    "source": "cryptopotato",
    "body": "The Core Team behind the popular project hosted its first hackathon event during the Open Network era earlier this year, which concluded in mid-October. After two months in which they didn’t post any updates on the matter, the team outlined the winners earlier this week and their respective prizes. Hackathon Winners CryptoPotato reported in August the details about the event, which started on the 21st of that month. The optional midpoint check-in took place in mid-September, while the entire event was scheduled to conclude on October 15. Following two months of inactivity on the matter, the Core Team finally announced the winners of the Pi Hackathon 2025 on Thursday: 1st Place : Blind_Lounge , a privacy-first social and dating platform where people connect anonymously and reveal identities only by mutual choice. 2nd Place : Starmax , a loyalty program app that enables Pioneers to spend Pi at participating businesses and earn rewards for their engagement. 3rd Place : RUN FOR PI , a fast-paced runner game that incorporates Pi directly into its in-game economy. The hackathon rules stated that the first-positioned Pioneer will receive 75,000 PI tokens, the second will get 45,000, and 15,000 coins will go to the third. The five honorable mentions will receive 5,000 each, which were as follows: Kindrek, Workflet For Pi, PallyPay, SimpleJoy, and Agora Pulse. Overall, the team said there were more than 215 Mainnet app submissions received from August to October that met the ecosystem requirements. They added that this showcases developers’ “clear motivation to build utility-oriented, production-ready apps on the Pi Mainnet.” The Fine Print However, the Core Team also warned that some of the features on these apps could be a work in progress and outlined the possibility of occasional bugs or limitations as they are community-built projects that continue to evolve after the hackathon. The disclosure also reads that, since they do not officially develop these apps, they do not have any affiliation with Pi Network itself. “Likewise, all decisions, features, and limitations of these apps are determined solely by their respective app teams. Use of these apps is at your own discretion and risk, and by using such apps you acknowledge and agree that Pi Network is not responsible for any issues you may encounter, including but not limited to, those relating to and arising from transactions, data security, user experience, or access and use.” The post urged users who encounter any issues with the apps or have suggestions to share them directly through the application’s reporting channels or in the relevant community spaces. The post Major PI News: Pi Network Breaks Silence With Long-Awaited Winner Announcement appeared first on CryptoPotato .",
    "tags": "Crypto Bits|Crypto News|Pi Network (PI)",
    "categories": "CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Crypto Potato",
      "img": "https://images.cryptocompare.com/news/default/cryptopotato.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55681265",
    "guid": "https://cointelegraph.com/news/binance-upbit-hack-funds-freeze-kbs-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "published_on": 1765533605,
    "imageurl": "https://images.cryptocompare.com/news/default/cointelegraph.png",
    "title": "Upbit hack puts Binance’s emergency freeze policy under scrutiny",
    "url": "https://cointelegraph.com/news/binance-upbit-hack-funds-freeze-kbs-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "cointelegraph",
    "body": "Binance reportedly froze only about 17% of the funds that South Korean police linked to the Upbit hack, raising questions over how major exchanges act on cross-border law enforcement.",
    "tags": "",
    "categories": "EXCHANGE|REGULATION|BNB|CRYPTOCURRENCY|SECURITY INCIDENTS",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Cointelegraph",
      "img": "https://images.cryptocompare.com/news/default/cointelegraph.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680788",
    "guid": "https://bitcoinworld.co.in/?p=244226",
    "published_on": 1765532897,
    "imageurl": "https://resources.cryptocompare.com/news/82/default.png",
    "title": "Phemex Co-hosts LONGITUDE, Spotlighting the Next Era of Crypto Security at Its 6th Anniversary",
    "url": "https://bitcoinworld.co.in/phemex-co-hosts-longitude-spotlighting-the-next-era-of-crypto-security-at-its-6th-anniversary/",
    "source": "bitcoinworld",
    "body": "BitcoinWorld Phemex Co-hosts LONGITUDE, Spotlighting the Next Era of Crypto Security at Its 6th Anniversary APIA, Samoa , Dec. 12, 2025 /PRNewswire/ — Phemex , a user-first crypto exchange, successfully co-hosted the 7th edition of LONGITUDE with Cointelegraph on December 11 at the Rosewood Hotel in Abu Dhabi. Held alongside Abu Dhabi Finance Week, the gathering brought together Web3 leaders and institutional innovators for an evening of strategic dialogue, celebrating Phemex’s 6th anniversary. The exclusive agenda featured industry heavyweights including Anthony Scaramucci (SkyBridge) and Kristin Smith (Solana Policy Institute), who dissected market trends in the “Solana SZN” panel, while Eli Ben-Sasson (StarkWare) explored the critical role of privacy in a dedicated fireside chat. Meanwhile, the night’s centerpiece was the “Crypto’s Security Dilemma” panel. Phemex CEO Federico Variola joined Ian Rogers (Ledger) and Dmytro Budorin (Hacken) to address the sector’s most urgent defense challenges. Federico argued that the industry’s standard “reactive” security model is obsolete against modern AI threats. He advocated for a shift to “Predictive Security Architecture,” revealing how Phemex now uses AI to analyze user behavior patterns to stop threats before they materialize. Federico also used the stage to unveil Phemex’s strategic roadmap, highlighting the incubation of a new Account Abstraction wallet designed to bridge Web2 and Web3. “Beyond hardening our infrastructure with predictive AI, we are fundamentally evolving the platform,” said Federico. “We are building a holistic ecosystem — combining a CEX, a DEX, and a self-custodial wallet — where security is the anchor that allows users to move seamlessly between custody models.” As Phemex enters its seventh year, the event underscored the exchange’s commitment to redefining user protection. By fostering high-level dialogue and partnership among decision-makers, Phemex continues to lead the charge in building a transparent, secure, and unified digital asset future. About Phemex Founded in 2019, Phemex is a user-first crypto exchange trusted by over 10 million traders worldwide. The platform offers spot and derivatives trading, copy trading, and wealth management products designed to prioritize user experience, transparency, and innovation. With a forward-thinking approach and a commitment to user empowerment, Phemex delivers reliable tools, inclusive access, and evolving opportunities for traders at every level to grow and succeed. For more information, please visit: https://phemex.com/ This post Phemex Co-hosts LONGITUDE, Spotlighting the Next Era of Crypto Security at Its 6th Anniversary first appeared on BitcoinWorld .",
    "tags": "Press Release",
    "categories": "EXCHANGE|MARKET|SOL|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoin World",
      "img": "https://resources.cryptocompare.com/news/82/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680789",
    "guid": "https://thecryptobasic.com/?p=146766",
    "published_on": 1765532892,
    "imageurl": "https://resources.cryptocompare.com/news/65/55680789.jpeg",
    "title": "Top Analyst Says “Buying Some Cardano Here” Amid Trendine Breakout",
    "url": "https://thecryptobasic.com/2025/12/12/top-analyst-says-buying-some-cardano-here-amid-trendine-breakout/",
    "source": "thecryptobasic",
    "body": "Analysts are gaining exposure to Cardano at the current price level, as a bullish chart setup suggests an impulsive uptrend is imminent. Prominent market watcher Captain Faibik is among those predicting that Cardano could reach new heights from here, despite its lackluster price trend. Visit Website",
    "tags": "Market|ADA Price Prediction|Latest Cardano (ADA) Crypto News Today",
    "categories": "ADA|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "The Crypto Basic",
      "img": "https://images.cryptocompare.com/news/default/thecryptobasic.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680787",
    "guid": "https://bitzo.com/2025/12/phemex-co-hosts-longitude-spotlighting-the-next-era-of-crypto-security-at-its-6th-anniversary",
    "published_on": 1765532875,
    "imageurl": "https://resources.cryptocompare.com/news/104/55680787.jpeg",
    "title": "Phemex Co-hosts LONGITUDE, Spotlighting the Next Era of Crypto Security at Its 6th Anniversary",
    "url": "https://bitzo.com/2025/12/phemex-co-hosts-longitude-spotlighting-the-next-era-of-crypto-security-at-its-6th-anniversary",
    "source": "bitzo",
    "body": "APIA, Samoa, Dec. 12, 2025 /PRNewswire/ -- Phemex , a user-first crypto exchange, successfully co-hosted the 7th edition of LONGITUDE with Cointelegraph on December 11 at the Rosewood Hotel in Abu Dhabi. Held alongside Abu Dhabi Finance Week, the gathering brought together Web3 leaders and institutional innovators for an evening of strategic dialogue, celebrating Phemex's 6th anniversary. The exclusive agenda featured industry heavyweights including Anthony Scaramucci (SkyBridge) and Kristin Smith (Solana Policy Institute), who dissected market trends in the \"Solana SZN\" panel, while Eli Ben-Sasson (StarkWare) explored the critical role of privacy in a dedicated fireside chat. Meanwhile, the night's centerpiece was the \"Crypto's Security Dilemma\" panel. Phemex CEO Federico Variola joined Ian Rogers (Ledger) and Dmytro Budorin (Hacken) to address the sector's most urgent defense challenges. Federico argued that the industry's standard \"reactive\" security model is obsolete against modern AI threats. He advocated for a shift to \"Predictive Security Architecture,\" revealing how Phemex now uses AI to analyze user behavior patterns to stop threats before they materialize. Federico also used the stage to unveil Phemex's strategic roadmap, highlighting the incubation of a new Account Abstraction wallet designed to bridge Web2 and Web3. \"Beyond hardening our infrastructure with predictive AI, we are fundamentally evolving the platform,\" said Federico. \"We are building a holistic ecosystem — combining a CEX, a DEX, and a self-custodial wallet — where security is the anchor that allows users to move seamlessly between custody models.\" As Phemex enters its seventh year, the event underscored the exchange's commitment to redefining user protection. By fostering high-level dialogue and partnership among decision-makers, Phemex continues to lead the charge in building a transparent, secure, and unified digital asset future. About Phemex Founded in 2019, Phemex is a user-first crypto exchange trusted by over 10 million traders worldwide. The platform offers spot and derivatives trading, copy trading, and wealth management products designed to prioritize user experience, transparency, and innovation. With a forward-thinking approach and a commitment to user empowerment, Phemex delivers reliable tools, inclusive access, and evolving opportunities for traders at every level to grow and succeed. For more information, please visit: https://phemex.com/ Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Bitzo, nor is it intended to be used as legal, tax, investment, or financial advice.",
    "tags": "More News",
    "categories": "EXCHANGE|REGULATION|SOL|SPONSORED|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitzo",
      "img": "https://resources.cryptocompare.com/news/104/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680852",
    "guid": "https://cryptodaily.co.uk/2025/12/phemex-co-hosts-longitude-spotlighting-the-next-era-of-crypto-security-at-its-6th-anniversary",
    "published_on": 1765532791,
    "imageurl": "https://resources.cryptocompare.com/news/75/55680852.jpeg",
    "title": "Phemex Co-hosts LONGITUDE, Spotlighting the Next Era of Crypto Security at Its 6th Anniversary",
    "url": "https://cryptodaily.co.uk/2025/12/phemex-co-hosts-longitude-spotlighting-the-next-era-of-crypto-security-at-its-6th-anniversary",
    "source": "cryptodaily",
    "body": "APIA, Samoa, Dec. 12, 2025 /PRNewswire/ -- Phemex , a user-first crypto exchange, successfully co-hosted the 7th edition of LONGITUDE with Cointelegraph on December 11 at the Rosewood Hotel in Abu Dhabi. Held alongside Abu Dhabi Finance Week, the gathering brought together Web3 leaders and institutional innovators for an evening of strategic dialogue, celebrating Phemex's 6th anniversary. The exclusive agenda featured industry heavyweights including Anthony Scaramucci (SkyBridge) and Kristin Smith (Solana Policy Institute), who dissected market trends in the \"Solana SZN\" panel, while Eli Ben-Sasson (StarkWare) explored the critical role of privacy in a dedicated fireside chat. Meanwhile, the night's centerpiece was the \"Crypto's Security Dilemma\" panel. Phemex CEO Federico Variola joined Ian Rogers (Ledger) and Dmytro Budorin (Hacken) to address the sector's most urgent defense challenges. Federico argued that the industry's standard \"reactive\" security model is obsolete against modern AI threats. He advocated for a shift to \"Predictive Security Architecture,\" revealing how Phemex now uses AI to analyze user behavior patterns to stop threats before they materialize. Federico also used the stage to unveil Phemex's strategic roadmap, highlighting the incubation of a new Account Abstraction wallet designed to bridge Web2 and Web3. \"Beyond hardening our infrastructure with predictive AI, we are fundamentally evolving the platform,\" said Federico. \"We are building a holistic ecosystem — combining a CEX, a DEX, and a self-custodial wallet — where security is the anchor that allows users to move seamlessly between custody models.\" As Phemex enters its seventh year, the event underscored the exchange's commitment to redefining user protection. By fostering high-level dialogue and partnership among decision-makers, Phemex continues to lead the charge in building a transparent, secure, and unified digital asset future. About Phemex Founded in 2019, Phemex is a user-first crypto exchange trusted by over 10 million traders worldwide. The platform offers spot and derivatives trading, copy trading, and wealth management products designed to prioritize user experience, transparency, and innovation. With a forward-thinking approach and a commitment to user empowerment, Phemex delivers reliable tools, inclusive access, and evolving opportunities for traders at every level to grow and succeed. For more information, please visit: https://phemex.com/ Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.",
    "tags": "More News",
    "categories": "EXCHANGE|REGULATION|SOL|SPONSORED|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Crypto Daily",
      "img": "https://resources.cryptocompare.com/news/75/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680638",
    "guid": "https://bitcoinworld.co.in/?p=244217",
    "published_on": 1765532711,
    "imageurl": "https://resources.cryptocompare.com/news/82/default.png",
    "title": "Powerful Partnership: Standard Chartered and Coinbase Supercharge Crypto Prime Services for Institutions",
    "url": "https://bitcoinworld.co.in/standard-chartered-coinbase-crypto-prime-services/",
    "source": "bitcoinworld",
    "body": "BitcoinWorld Powerful Partnership: Standard Chartered and Coinbase Supercharge Crypto Prime Services for Institutions The landscape for professional cryptocurrency investment is evolving rapidly. In a significant move, banking giant Standard Chartered and leading crypto exchange Coinbase have announced a powerful expansion of their partnership. Their primary goal? To dramatically enhance and broaden their crypto prime services for institutional clients worldwide. This collaboration signals a major step in bridging traditional finance with the digital asset ecosystem. What Are Crypto Prime Services and Why Do They Matter? For institutions, diving into cryptocurrencies involves more than just buying Bitcoin. They require sophisticated infrastructure that matches what they have in traditional markets. Crypto prime services provide this essential backbone. Think of them as a comprehensive suite of professional-grade tools: high-volume trading, secure custody of assets, lending facilities, and staking for earning rewards. This partnership aims to build a seamless, regulated gateway for large-scale investors. How Will This Expanded Partnership Work? The collaboration builds on an existing successful model in Singapore. There, Standard Chartered already enables real-time Singapore dollar (SGD) transfers for Coinbase’s clients. Now, they are scaling this model globally. The expanded focus will develop integrated solutions across several critical areas: Trading & Execution: Providing deep liquidity and efficient trade execution for large orders. Secure Custody: Offering institutional-grade storage solutions for digital assets. Staking & Lending: Creating avenues for institutions to earn yield on their crypto holdings. Prime Brokerage: Delivering a unified platform that consolidates these services under one roof. This holistic approach addresses the core needs of hedge funds, family offices, and asset managers looking for trusted entry points. What Are the Key Benefits for Institutional Investors? This alliance combines distinct strengths. Standard Chartered brings over 160 years of banking trust, regulatory expertise, and a global network. Coinbase contributes its leading technology, deep crypto market access, and proven compliance framework. Together, they offer institutions a compelling package: Regulatory Confidence: Navigating the complex global regulatory landscape becomes more straightforward. Operational Security: Combining bank-level security with crypto-native safeguards reduces risk. Market Access: Institutions gain a reliable and liquid on-ramp to major digital assets. Therefore, the partnership lowers the traditional barriers to entry, making crypto asset allocation a more viable and secure strategy for professional portfolios. What Does This Mean for the Future of Crypto Adoption? The expansion of these crypto prime services is a strong validation signal for the entire industry. When established global banks like Standard Chartered deepen their commitment, it encourages other traditional financial players to follow. Moreover, it provides the necessary infrastructure for potentially billions in institutional capital waiting on the sidelines. The move accelerates the maturation of crypto markets, pushing them closer to the efficiency and stability of traditional finance. Conclusion: A Major Inflection Point The strengthened partnership between Standard Chartered and Coinbase is more than a business deal; it’s a powerful catalyst. By building robust crypto prime services , they are constructing the financial plumbing needed for widespread institutional adoption. This collaboration demonstrates that the future of finance is not a choice between old and new systems, but a strategic integration of both. For institutional investors, the path to digital assets just became clearer, safer, and more accessible. Frequently Asked Questions (FAQs) What are crypto prime services? Crypto prime services are a suite of professional financial services tailored for institutional investors in digital assets. They typically include trading, lending, borrowing, custody, and staking, all provided through a single, integrated platform. Why is the Standard Chartered and Coinbase partnership important? It combines the trust, regulatory reach, and banking infrastructure of a major global bank with the technology and crypto market expertise of a leading exchange. This blend is crucial for attracting large, risk-averse institutional capital. Who can use these expanded crypto prime services? The services are designed for institutional clients such as hedge funds, asset managers, family offices, and corporations, not for individual retail investors. What was the foundation of this partnership? The collaboration builds on their existing work in Singapore, where Standard Chartered facilitates real-time fiat currency transfers for Coinbase clients, proving the model’s effectiveness. How does this affect the average crypto investor? While direct access is for institutions, this development contributes to overall market maturity, liquidity, and stability, which can positively impact the broader ecosystem that retail investors participate in. Are there risks with these services? As with all crypto activities, risks related to market volatility, technology, and regulation remain. However, the involvement of a major bank aims to mitigate operational and counterparty risks through stringent compliance and security measures. Join the Conversation This partnership is a landmark moment for institutional crypto adoption. Do you think more major banks will follow suit? Share your thoughts and this article on social media to discuss the future of finance with your network. To learn more about the latest trends in institutional crypto adoption, explore our article on key developments shaping the cryptocurrency landscape and future market growth. This post Powerful Partnership: Standard Chartered and Coinbase Supercharge Crypto Prime Services for Institutions first appeared on BitcoinWorld .",
    "tags": "Crypto News|banking|BLOCKCHAIN|CRYPTOCURRENCY|Digital Assets|Institutional Investing",
    "categories": "ASIA|BUSINESS|EXCHANGE|MARKET|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoin World",
      "img": "https://resources.cryptocompare.com/news/82/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55681143",
    "guid": "https://en.coinotag.com/standard-chartered-and-capital-a-plan-ringgit-pegged-stablecoin-pilot-in-malaysia",
    "published_on": 1765532651,
    "imageurl": "https://resources.cryptocompare.com/news/77/55681143.jpeg",
    "title": "Standard Chartered and Capital A Plan Ringgit-Pegged Stablecoin Pilot in Malaysia",
    "url": "https://en.coinotag.com/standard-chartered-and-capital-a-plan-ringgit-pegged-stablecoin-pilot-in-malaysia",
    "source": "coinotag",
    "body": "Standard Chartered Malaysia and Capital A, AirAsia's parent, have signed a letter of intent to explore a ringgit-pegged stablecoin for wholesale applications under Bank Negara Malaysia's Digital Asset Innovation Hub, marking a key step in integrating digital assets into the nation's financial ecosystem. Joint Initiative: Standard Chartered will issue the stablecoin, leveraging its infrastructure, while [...]",
    "tags": "News",
    "categories": "FIAT|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680490",
    "guid": "https://bitcoinworld.co.in/?p=244218",
    "published_on": 1765532411,
    "imageurl": "https://resources.cryptocompare.com/news/82/default.png",
    "title": "Binance Perpetual Futures: A Bold Move with New US and CYS Listings",
    "url": "https://bitcoinworld.co.in/binance-perpetual-futures-us-cys/",
    "source": "bitcoinworld",
    "body": "BitcoinWorld Binance Perpetual Futures: A Bold Move with New US and CYS Listings In a significant expansion of its derivatives offerings, Binance, the world’s leading cryptocurrency exchange, has made a bold announcement. The platform is set to list two new perpetual futures contracts: US/USDT and CYS/USDT. This move provides traders with fresh avenues for speculation and hedging, directly impacting the Binance perpetual futures market. The launch is scheduled for today, promising immediate action for the trading community. What Are the New Binance Perpetual Futures Contracts? Binance will introduce these contracts in a swift, sequential launch. The US/USDT perpetual futures contract goes live first at 10:45 a.m. UTC. Shortly after, at 11:00 a.m. UTC, the CYS/USDT contract will commence trading. These are settled in USDT, meaning traders use Tether to manage their positions and profits. The exchange is supporting substantial leverage, which is a key feature for these Binance perpetual futures products. US/USDT Contract: Offers leverage of up to 40x. CYS/USDT Contract: Offers leverage of up to 20x. This tiered leverage structure suggests Binance has assessed different risk profiles for each asset. Higher leverage on the US pair indicates potentially higher liquidity or lower perceived volatility. However, traders must remember that leverage magnifies both gains and losses. Why Should Traders Pay Attention to This Launch? New listings on a major exchange like Binance often lead to increased volatility and trading volume. For active traders, this presents a clear opportunity. Early movers can capitalize on initial price discovery phases. Furthermore, adding these pairs diversifies the available Binance perpetual futures portfolio, allowing for more complex trading strategies. For instance, traders might use these new contracts for pairs trading or to express a view on these specific assets without needing to hold the underlying spot tokens. The perpetual nature of the contracts means there is no expiry date, providing flexibility for longer-term positions, though traders must manage funding rates. What Are the Key Risks and Considerations? While opportunity beckons, caution is paramount. The primary risk with any Binance perpetual futures product, especially with high leverage, is liquidation. A 40x leverage means a mere 2.5% price move against your position could wipe out your margin. Therefore, robust risk management is non-negotiable. Always use stop-loss orders. Never allocate your entire capital to a single leveraged position. Understand how funding rates work, as they can erode profits over time. Moreover, newer or less-established tokens like CYS might exhibit lower liquidity initially. This can lead to wider bid-ask spreads and increased slippage, making entry and exit more costly. Traders should monitor the order book depth closely in the first few hours after launch. How Does This Fit Into Binance’s Broader Strategy? This listing is not an isolated event. It reflects Binance’s continuous effort to dominate the crypto derivatives market. By consistently adding new products, Binance attracts a wider user base, from retail speculators to institutional players seeking specific exposures. Each new Binance perpetual futures contract strengthens the ecosystem’s liquidity and utility. For the projects behind US and CYS, a Binance listing is a major milestone that boosts credibility and visibility. It often leads to increased interest in the spot markets for these tokens as well, creating a synergistic effect across different trading verticals on the exchange. Conclusion: A Calculated Opportunity for the Informed Trader Binance’s launch of US and CYS perpetual futures is a calculated move that expands market access. It offers powerful tools for experienced traders but comes with significant risks that demand respect. The key to navigating this new opportunity lies in preparation. Understand the contracts, have a clear strategy, and prioritize risk management above the allure of high leverage. For those ready, the markets are now open. Frequently Asked Questions (FAQs) Q1: What is a perpetual futures contract? A: A perpetual futures contract is a derivative product that allows you to speculate on an asset’s price without an expiry date. It uses a funding rate mechanism to keep its price tethered to the underlying spot market. Q2: What time do the new Binance futures contracts launch? A: The US/USDT contract launches at 10:45 a.m. UTC, and the CYS/USDT contract launches at 11:00 a.m. UTC on the announcement date. Q3: What is the maximum leverage for these new contracts? A: The US/USDT contract supports up to 40x leverage, while the CYS/USDT contract supports up to 20x leverage. Q4: Do I need to hold US or CYS tokens to trade these futures? A: No. Perpetual futures are settled in USDT. You only need USDT in your futures wallet to trade these contracts and cover margin requirements. Q5: Are these contracts available to users in the United States? A: No. Binance.com derivatives products, including these new perpetual futures, are not available to users in restricted jurisdictions, which includes the United States. Eligible users must check their local regulations. Q6: What’s the main risk of trading with high leverage? A: The main risk is liquidation. High leverage amplifies losses, meaning a small adverse price move can quickly wipe out your posted margin, closing your position at a loss. Found this guide to the new Binance perpetual futures helpful? Share it with your trading community on Twitter or Telegram to help other traders stay informed and navigate these new markets wisely! To learn more about the latest cryptocurrency trends, explore our article on key developments shaping the crypto derivatives landscape and institutional adoption. This post Binance Perpetual Futures: A Bold Move with New US and CYS Listings first appeared on BitcoinWorld .",
    "tags": "Crypto News|BINANCE|Crypto Derivatives|CRYPTOCURRENCY|Futures Trading|USDT",
    "categories": "EXCHANGE|TRADING|ZRX|BNB|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoin World",
      "img": "https://resources.cryptocompare.com/news/82/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680684",
    "guid": "https://www.bitdegree.org/crypto/news/jp-morgan-and-galaxy-digital-launch-50-million-tokenized-debt-on-solana",
    "published_on": 1765532389,
    "imageurl": "https://resources.cryptocompare.com/news/66/55680684.jpeg",
    "title": "JP Morgan and Galaxy Digital Launch $50 Million Tokenized Debt on Solana",
    "url": "https://www.bitdegree.org/crypto/news/jp-morgan-and-galaxy-digital-launch-50-million-tokenized-debt-on-solana",
    "source": "bitdegree",
    "body": "On December 11, JP Morgan arranged a US commercial paper issuance on the Solana SOL blockchain , carried out on behalf of Galaxy Digital Holdings LP.",
    "tags": "blockchain",
    "categories": "BLOCKCHAIN|SOL|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "BitDegree",
      "img": "https://images.cryptocompare.com/news/default/bitdegree.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680557",
    "guid": "https://en.coinotag.com/breakingnews/drift-to-launch-native-mobile-app-on-solana-sol-with-multi-collateral-accounts-deeper-liquidity-and-faster-trade-execution",
    "published_on": 1765532320,
    "imageurl": "https://resources.cryptocompare.com/news/77/55680557.jpeg",
    "title": "Drift to Launch Native Mobile App on Solana (SOL) with Multi-Collateral Accounts, Deeper Liquidity, and Faster Trade Execution",
    "url": "https://en.coinotag.com/breakingnews/drift-to-launch-native-mobile-app-on-solana-sol-with-multi-collateral-accounts-deeper-liquidity-and-faster-trade-execution",
    "source": "coinotag",
    "body": "Drift to Launch Native Mobile App on Solana (SOL) with Multi-Collateral Accounts, Deeper Liquidity, and Faster Trade Execution",
    "tags": "Breaking News",
    "categories": "SOL|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680387",
    "guid": "https://square.htx.com/?p=47114",
    "published_on": 1765532319,
    "imageurl": "https://resources.cryptocompare.com/news/100/default.png",
    "title": "HTX Takes the Crown for the Most Net Inflows of $583.7M Over the Past 30 Days",
    "url": "https://square.htx.com/htx-takes-the-crown-for-the-most-net-inflows-of-583-7m-over-the-past-30-days/",
    "source": "huobi",
    "body": "In a market defined by rapid narrative shifts and unpredictable volatility, one metric never lies: the direction of capital flows. According to DefiLlama data as of December 5, HTX recorded $583.7 million in net inflows over the past 30 days, ranking first among all centralized exchanges globally. The platform also maintained steady growth in total user assets and rising spot trading volume, reinforcing a positive cycle built on asset security, expanding user activity, and accelerating capital inflows. Source: DefiLlama (December 5) This leadership is not a momentary spike but the culmination of a sustained trend. When uncertainty rises, users naturally gravitate toward the platforms they trust most. HTX’s strong net inflow performance ultimately results from millions of users making the same decision. Behind the Numbers: A Real Vote of Confidence from Users In the competitive arena of centralized exchanges, net inflow is one of the most accurate indicators of user behavior. Exchanges with consistent inflows tend to outperform in passive income products, new asset listings, user experience, and operational transparency. When users deposit assets onto a platform, they are communicating a simple but powerful message: they believe the exchange is safe, solvent, and reliable, and that it will not freeze withdrawals, suffer liquidity stress, or engage in opaque operations. Amid the crypto market cycle fluctuations, HTX’s position at the top signals that its reputation for stability and reliability is being re-established. Its core businesses, especially Earn products with asset transparency, have gained real traction. In other words, HTX is entering a new phase of increasing trust across the global market. Why HTX? Three Strategic Drivers Behind the Surge Since the second half of 2025, HTX has made major efforts across transparency, security, and compliance, strengthening its operations and setting the stage for this wave of net inflows. On asset transparency, HTX, one of the first movers in the industry to publish Proof of Reserves, has now disclosed Merkle Tree-based PoR data for 38 consecutive months. All major assets on the platform consistently maintain reserve ratios at or above 100%. Users can access the “ Assets > Proof of Reserves ” section at any time on HTX’s official website to verify monthly reserve reports. Visibility is the strongest form of risk control and HTX’s philosophy is simple: users should always be able to see their money. On security and compliance, HTX is presenting the advantages of a platform founded in 2013. With upgraded compliance architecture and security system, the platform has strengthened its capability in anti-money laundering, on-chain monitoring, and account risk management. Twelve years of security engineering and risk management act as a buffer during critical market cycles, making HTX a preferred destination when stability matters most. What Are Users Choosing When They Move Their Assets to HTX Earn ? HTX’s return to the top of the industry is rooted in one thing: the platform understands exactly what users really want. Crypto users in 2025 are far more pragmatic. They’re no longer swayed by narratives. They look at yield, at user experience, and at security. And HTX’s upgrades across its core business lines align precisely with those three priorities. Let’s illustrate this with HTX Earn’s performance over the past seven days. Both total assets subscribed and total participants have risen meaningfully. Specifically, USDD subscriptions in HTX Earn increased 25.5%, with participants up 12.4%. ETH subscription amounts rose 17.2%, while TRX products’ participants increased 6.7%. The trend is unmistakable: users are allocating more long-term capital into the HTX Earn products. In a market where directional trading is difficult and volatility provides more stress than opportunity, many investors now prioritize stable, predictable returns. That shift has fueled the rapid expansion of HTX Earn. Its advantages can be summarized in three qualities of stability, simplicity, and superior yields. HTX Earn features the user-first principle. Investors are flocking to HTX Earn because of the following strengths: Simple & Seamless: Easy to use, one-click subscription, flexible redemption. No gimmicks, ideal for long-term holding. Transparent Yield: Returns from subscriptions to core assets are more transparent with no complex derivative rules and hidden terms. Competitive & Stable Returns: Earn steady yields on stablecoins and major cryptocurrencies with APYs above the industry average. Across social platforms, users have expressed the same sentiment repeatedly: “When markets are unstable, HTX is the only place I trust with my stablecoin yields.” Capital flows don’t lie and the surge in net inflows validates that trust. HTX Is Rebuilding Industry-Wide Confidence HTX’s performance throughout 2025 speaks for itself. The rise is the result of systemic upgrades. From greater asset transparency and enhanced security to the explosive growth of HTX Earn, the platform has demonstrated consistent resilience during a turbulent period for the industry. All of these strengths converge into the clearest metric of all: as of December 5, HTX ranked No.1 in 30-day net inflows among all global CEXs. As the industry transitions into the “trust premium” phase, capital naturally flows toward platforms that are more transparent, more stable, and more aligned with value creation. Investors have already given their verdict through their actions: HTX is the exchange they trust most with their assets. The post HTX Takes the Crown for the Most Net Inflows of $583.7M Over the Past 30 Days first appeared on HTX Square .",
    "tags": "Latest at HTX|CEX|CryptoCurrency|HTX",
    "categories": "BUSINESS|EXCHANGE|FIAT|MARKET|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Huobi blog",
      "img": "https://resources.cryptocompare.com/news/100/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680347",
    "guid": "https://thecryptobasic.com/?p=146776",
    "published_on": 1765532247,
    "imageurl": "https://resources.cryptocompare.com/news/65/55680347.jpeg",
    "title": "SEC Backs DTCC Three-Year Pilot to Tokenize U.S. Securities on Select Blockchains",
    "url": "https://thecryptobasic.com/2025/12/12/sec-backs-dtcc-three-year-pilot-to-tokenize-u-s-securities-on-select-blockchains/",
    "source": "thecryptobasic",
    "body": "The U.S. SEC has approved a three-year pilot that allows the Depository Trust Company to test blockchain-based recordkeeping for certain U.S. Visit Website",
    "tags": "Market|Latest SEC Cryptocurrency News",
    "categories": "MARKET|REGULATION",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "The Crypto Basic",
      "img": "https://images.cryptocompare.com/news/default/thecryptobasic.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680350",
    "guid": "https://www.cryptopolitan.com/?p=877171",
    "published_on": 1765532191,
    "imageurl": "https://resources.cryptocompare.com/news/43/55680350.jpeg",
    "title": "Armenia prolongs authorization for crypto trading using cash",
    "url": "https://www.cryptopolitan.com/armenia-permission-crypto-trading-cash/",
    "source": "cryptopolitan",
    "body": "Authorities in Yerevan are extending a temporary exemption allowing Armenians to buy and sell cryptocurrencies with fiat cash. Certain restrictions apply, but the move will give domestic crypto platforms and their users more time to comply with the country’s recently adopted regulations. Armenians allowed to exchange crypto with cash in 2026 Armenia is postponing a ban on cash purchases and sales of cryptocurrency into the next year, local media revealed this week. The government has already approved the necessary amendments to the new law “On Crypto Assets” which will be submitted to the parliament soon. Officials were initially planning to prohibit cash transactions in crypto trading right after the legislation entered into force on July 4, 2025. However, it was later decided to introduce a transitional period before the ban is enforced to help companies adapt to the current regulations. Crypto businesses were also given a full year to obtain the mandatory licenses from the country’s central bank, Sputnik Armenia recalled in a report on Thursday. Thus, platforms working with digital assets are now free to process cash orders until July 2026, although not without limitations. The amount of each individual transaction must not exceed 300,000 Armenian drams, or $785 at the time of writing. Furthermore, the selling entity is responsible for conducting proper identification of its customers and keeping full records of all their transactions. During the interim period, the Central Bank of Armenia ( CBA ) retains the power to verify compliance of market participants at any given moment. The extension concerns a number of exchange offices operating in Armenia that continue to accept cash for cryptocurrency trades, the news outlet noted. Armenia takes road to regulated crypto market Armenian authorities have been taking steps this year to put the country’s crypto space in order. The digital assets bill was finalized in February and filed with the National Assembly in April, before lawmakers passed it at the end of May. The legal framework introduces regulations governing the trading of coins, the provision of related services as well as the oversight of the market. Ensuring investor protection to improve confidence in the industry is another of its main goals. Under the legislation, platforms operating with crypto assets, including exchanges and issuers, are obliged to disclose details about their owners and meet minimum capital requirements. At the time this was proposed, Armenian media and officials explained the particular focus on ownership and capital sources with the need to improve “ financial hygiene ” in the sector. Another key feature of the law is that it allows commercial banks to offer crypto services, although to do that, they need to set up a separate legal entity and obtain a dedicated license from the monetary authority. In April, CBA Deputy Governor Armen Nurbekyan remarked: “In the presence of uniform rules, Armenian banks, which have long been interested in this domain, can also officially offer cryptocurrency services.” In September, his superior, the central bank’s Chairman Martin Galstyan, suggested that the banking sector should learn to manage the risks associated with decentralized digital currencies to make their crypto services more accessible. Armenia praised for crypto growth and regulation Much like some of its neighbors in the Southern Caucasus, such as Georgia , Armenia has been watching its crypto sector grow over the past few years, but only recently moved to properly regulate it. This week, Binance’s Marketing Manager in Central Asia and the CIS countries, Stanislav Delyonok, highlighted its status as a regional leader in terms of crypto investments. Quoted by the banking news outlet Armbanks.am on Saturday, he stated: “Armenia is at the forefront of crypto development, integrating digital assets in various spheres of life.” The country ranks 14th in the Global Cryptocurrency Investment Index, he pointed out, noting that every tenth resident of the small nation of around 3 million people is already a user of the largest crypto exchange. “We see a huge potential for the development of Armenia’s crypto ecosystem and highly value initiatives that make digital assets more understandable, safe and accessible,” added Kirill Khomyakov, head of markets in Central Asia, Central and Eastern Europe and Africa at Binance. Don’t just read crypto news. Understand it. Subscribe to our newsletter. It's free .",
    "tags": "Regulation|AMD|BTC|CBA|ETH",
    "categories": "EXCHANGE|REGULATION|TRADING|MACROECONOMICS|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Cryptopolitan",
      "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680555",
    "guid": "https://en.coinotag.com/breakingnews/pyth-network-launches-pyth-reserve-with-automatic-token-buybacks-tied-to-protocol-revenue",
    "published_on": 1765532182,
    "imageurl": "https://resources.cryptocompare.com/news/77/55680555.jpeg",
    "title": "Pyth Network Launches PYTH Reserve With Automatic Token Buybacks Tied to Protocol Revenue",
    "url": "https://en.coinotag.com/breakingnews/pyth-network-launches-pyth-reserve-with-automatic-token-buybacks-tied-to-protocol-revenue",
    "source": "coinotag",
    "body": "Pyth Network Launches PYTH Reserve With Automatic Token Buybacks Tied to Protocol Revenue",
    "tags": "Breaking News",
    "categories": "BLOCKCHAIN|BUSINESS|FIAT|PYTH",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680553",
    "guid": "https://en.coinotag.com/ena-faces-mixed-signals-near-0-26-resistance-in-corrective-phase",
    "published_on": 1765532107,
    "imageurl": "https://resources.cryptocompare.com/news/77/55680553.jpeg",
    "title": "ENA Faces Mixed Signals Near $0.26 Resistance in Corrective Phase",
    "url": "https://en.coinotag.com/ena-faces-mixed-signals-near-0-26-resistance-in-corrective-phase",
    "source": "coinotag",
    "body": "ENA price analysis reveals the token trading near short-term resistance at $0.266, caught in a corrective bear flag with mixed signals from RSI weakness and steady higher lows. This setup suggests potential upside toward $0.270 if support holds above $0.255, amid active volume and ecosystem TVL of $6.5B. ENA remains inside a corrective structure as [...]",
    "tags": "Analysis|News",
    "categories": "MARKET|TRADING|ENA|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680245",
    "guid": "https://timestabloid.com/?p=92093",
    "published_on": 1765532092,
    "imageurl": "https://resources.cryptocompare.com/news/67/default.png",
    "title": "XRP Price Analysis: XRP Tests Key Technical Levels",
    "url": "https://timestabloid.com/xrp-price-analysis-xrp-tests-key-technical-levels/",
    "source": "timestabloid",
    "body": "Market participants following XRP’s broader trend have focused closely on a new technical update shared by crypto analyst ChartNerd. The analyst drew attention to XRP’s position on the monthly chart, noting that the asset has returned to a level many traders have been monitoring for several months. The update was accompanied by a chart illustrating the current structure, which has added to the interest surrounding this retest. Comments from other market watchers followed, reinforcing the significance of the current setup. $XRP sits right on its flipped S/R trendline and is once again testing its monthly 20 EMA ($1.93). Hold the line! pic.twitter.com/2WtINGeqxc — ChartNerd (@ChartNerdTA) December 11, 2025 XRP Revisits Its Flipped Support-Resistance Trendline According to ChartNerd’s chart analysis, XRP is positioned directly on the same trendline that previously acted as resistance before the breakout earlier in the year. The analyst described this trendline as a flipped support-resistance level, indicating a zone that, if maintained, reinforces the strength of the broader breakout structure. The chart spans several years of XRP’s price history , showing that the current level has been tested multiple times during both upward and downward movements. The significance of this trendline lies in its historical reliability. The latest monthly candle shows price action contracting toward this line once again, suggesting that XRP’s ability to remain above it may help determine the next phase of the trend. The chart shows this area, with the green horizontal band marking the zone the analyst considers essential to hold. 20-Month EMA Retest Draws Market Attention ChartNerd also highlighted the technical importance of XRP’s retest of the 20-month exponential moving average, currently positioned at approximately $1.93. The EMA is shown in yellow on the chart, rising steadily and intersecting with XRP’s recent monthly candles. The asset’s wick and body both align closely with this EMA, emphasizing the precision of the retest. We are on X, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) June 15, 2025 A comment from X user Guoyu RWA noted the same interaction, stating that the $1.93 EMA test aligns with the flipped support-resistance trendline. The user added that maintaining this confluence could allow bullish control to re-establish itself if the level continues to act as support. This view matches the visual data presented in the chart, where the EMA and horizontal support converge to form a critical zone. What This Means for XRP’s Structure While no prediction was issued in the thread, the information presented shows that XRP is now positioned at a multi-year technical intersection. ChartNerd’s focus remains on whether the asset can maintain this area on the monthly timeframe, as the structure could guide expectations for future movement. The confluence between the long-term EMA and the flipped support-resistance level forms the central point of the analysis, emphasizing how XRP closes the month relative to these marks. Disclaimer : This content is meant to inform and should not be considered financial advice. The views expressed in this article may include the author’s personal opinions and do not represent Times Tabloid’s opinion. Readers are advised to conduct thorough research before making any investment decisions. Any action taken by the reader is strictly at their own risk. Times Tabloid is not responsible for any financial losses. Follow us on X , Facebook , Telegram , and Google News The post XRP Price Analysis: XRP Tests Key Technical Levels appeared first on Times Tabloid .",
    "tags": "Cryptocurrency|News|XRP|XRP Price|XRP Price Analysis",
    "categories": "MARKET|TRADING|XRP|RESEARCH|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "TimesTabloid",
      "img": "https://resources.cryptocompare.com/news/67/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680238",
    "guid": "https://thecryptobasic.com/?p=146792",
    "published_on": 1765532036,
    "imageurl": "https://images.cryptocompare.com/news/default/thecryptobasic.png",
    "title": "Dogecoin Price Prediction for Dec 12: Will DOGE Find Fib Support?",
    "url": "https://thecryptobasic.com/2025/12/12/dogecoin-price-prediction-for-dec-12-will-doge-find-fib-support/",
    "source": "thecryptobasic",
    "body": "Dogecoin faces resistance below key Fibonacci levels as it approaches crucial support. Will DOGE find support? Visit Website",
    "tags": "Analysis|Dogecoin Price Prediction|Latest Dogecoin (DOGE) News Today",
    "categories": "DOGE|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "The Crypto Basic",
      "img": "https://images.cryptocompare.com/news/default/thecryptobasic.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680074",
    "guid": "644209",
    "published_on": 1765531837,
    "imageurl": "https://images.cryptocompare.com/news/default/bitcoinist.png",
    "title": "Cardano Brings Pyth Oracles On-Chain In First Pentad Integration",
    "url": "https://bitcoinist.com/cardano-pyth-oracles-first-pentad-integration/",
    "source": "bitcoinist",
    "body": "Cardano is finally doing the unsexy but absolutely necessary plumbing work: getting serious, external oracle infrastructure wired in, with a governance wrapper that looks a lot more like “adult supervision” than the old ad-hoc ecosystem scramble. On a Dec. 11 livestream , Charles Hoskinson said the ecosystem’s new “Pentad” structure — the coordination bloc spanning Input Output, the Cardano Foundation, EMURGO, the Midnight Foundation, and Intersect — has approved its first major integration under the “critical integrations” framework: bringing Pyth’s Lazer oracle to Cardano, with deployment targeted for early 2026. Pyth Deal Kicks Off Cardano’s Critical Integrations Push “This is the appetizer announcement,” Hoskinson said, framing Pyth as the first of what he expects to be a broader menu: bridges, stablecoins , analytics, custodians — the stuff that turns a chain into a DeFi venue people actually build on, not just a community that argues about roadmaps. Hoskinson didn’t really sugarcoat why this matters. “Oracles are really the first part of major integrations,” he said, because you need reliable data coming in and you need credible pathways to the rest of the industry. He also admitted the in-house approach hasn’t landed the way it should’ve: Cardano “tried to build an indigenous oracle solution and it hasn’t worked out as well as it should.” So Pyth. That’s the pivot. Pyth, in its own marketing, has been pushing Lazer as an ultra-low latency product designed for speed-sensitive trading use cases — basically, price updates fast enough that perps and other twitchy DeFi apps don’t feel like they’re operating on last cycle’s data. Hoskinson called Pyth “one of the most advanced Oracle solutions on market,” and emphasized the practical angle: lots of feeds, lots of publishers, and broad distribution across chains. Intersect’s announcement (the one Hoskinson pulled up mid-stream) from X states: “One of the first concrete outcomes of the Critical Cardano Integrations workstream is now in place! The Steering Committee […] has approved the first major integration under this framework: bringing Pyth Lazer oracle to Cardano. Pyth provides low-latency, institutional-grade market data across thousands of price feeds spanning crypto, equities, FX, commodities and ETFs, already used by hundreds of DeFi applications across 100+ blockchains to power trading, lending and risk management.” Hoskinson argued, “[Pyth] effectively attaches Cardano now to the information networks of the entire cryptocurrency space.” He said the team is already exploring whether it can switch parts of the ecosystem — including Djed — over to Pyth, and he wants Cardano dapp teams to seriously evaluate the integration once it’s available. “Pyth is just the appetizer in the Cardano critical integrations,” he said. “There are many more things to come.” The broader context is that Cardano’s new “Pentad” has been positioning “critical integrations” as a coordinated, treasury-backed effort to “prime Cardano for 2026,” including a budget proposal tied to ecosystem-wide enablers. If Pyth is the first concrete output, it’s also a signal the Pentad model is going to be judged on execution, not vibes. Hoskinson, closing out, put it in his usual rally language: “Cardano is not an island anymore […] the cavalry has come.” The market can do what it wants in the short term. But getting credible oracle rails in place is the kind of boring upgrade that tends to matter later — when teams are deciding where to deploy, and where liquidity is willing to live. At press time, ADA traded at $0.4253.",
    "tags": "Cardano|ADA|ADA news|ADA Price|Cardano news|Cardano Price|Pyth",
    "categories": "ADA|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoinist",
      "img": "https://images.cryptocompare.com/news/default/bitcoinist.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680097",
    "guid": "https://bitcoinworld.co.in/?p=244211",
    "published_on": 1765531810,
    "imageurl": "https://resources.cryptocompare.com/news/82/default.png",
    "title": "Dollar Weekly Loss Reveals Market Turmoil: Sterling Plunges After Shocking GDP Drop",
    "url": "https://bitcoinworld.co.in/dollar-weekly-loss-sterling-gdp-drop/",
    "source": "bitcoinworld",
    "body": "BitcoinWorld Dollar Weekly Loss Reveals Market Turmoil: Sterling Plunges After Shocking GDP Drop The forex market is experiencing significant turbulence this week, with the US dollar heading for a notable weekly loss while the British pound faces additional pressure following disappointing economic data. For cryptocurrency traders watching traditional markets for correlation signals, these currency movements provide crucial insights into broader financial sentiment and potential risk-off scenarios that could impact digital asset valuations. Why Is the Dollar Facing a Weekly Loss? The US dollar’s decline represents a shift in market dynamics that cryptocurrency investors should monitor closely. Several factors are contributing to this dollar weekly loss : Reduced expectations for aggressive Federal Reserve rate hikes Improving risk sentiment in global markets Technical corrections after extended dollar strength Mixed economic data from the United States This dollar weakness creates interesting opportunities for cryptocurrency traders, as traditional safe-haven flows might redistribute across different asset classes, including digital currencies. Sterling Weakens: The Impact of UK Economic Contraction The British pound’s decline following the latest GDP drop highlights how economic fundamentals continue to drive currency movements . The UK economy contracted more than expected, raising concerns about the country’s economic resilience and the Bank of England’s policy path forward. Economic Indicator Actual Result Market Expectation Impact on Sterling Quarterly GDP Growth -0.3% -0.1% Negative Monthly GDP Change -0.5% -0.3% Negative Services Sector Output -0.8% -0.4% Negative This economic weakness directly contributes to why sterling weakens against major counterparts, creating potential arbitrage opportunities for traders who understand cross-market correlations. Forex Market Implications for Cryptocurrency Traders The current forex market conditions offer valuable lessons for cryptocurrency participants. When traditional currencies experience volatility, several patterns often emerge in digital asset markets: Increased correlation between Bitcoin and traditional safe-havens during risk-off periods Potential capital rotation from weakening fiat currencies into cryptocurrencies Changed dynamics for stablecoin pairs and trading volumes Altered institutional positioning across asset classes Understanding these currency movements helps cryptocurrency traders anticipate potential shifts in digital asset liquidity and investor sentiment. What Does the GDP Drop Mean for Global Markets? The UK’s GDP drop isn’t just a local concern—it signals potential trouble for the global economy. For cryptocurrency markets, which often move independently but remain sensitive to macroeconomic shocks, this development warrants attention: Potential for coordinated central bank policy responses Impact on risk appetite across all financial markets Changes in currency carry trade dynamics affecting liquidity Possible flight to quality affecting both traditional and digital assets The broader implications of this economic weakness could extend far beyond the forex market , influencing investor behavior across the entire financial spectrum. Actionable Insights for Navigating Currency Volatility Successful traders adapt to changing market conditions. Here’s how to approach the current environment of dollar weekly loss and sterling weakens trends: Monitor dollar index (DXY) levels for correlation signals with cryptocurrency markets Watch for breakouts in major currency pairs that might precede crypto market moves Consider how central bank policies might create divergence between traditional and digital assets Use currency volatility as a gauge for overall market risk appetite FAQs: Understanding the Currency Market Dynamics What caused the dollar’s weekly decline? The dollar’s weakness stems from reduced expectations for Federal Reserve rate hikes, improving global risk sentiment, and technical corrections after extended strength. Market participants are reassessing the pace of monetary tightening amid mixed economic signals. How significant is the UK GDP contraction for currency markets? The UK’s GDP contraction of 0.3% exceeded market expectations of 0.1%, indicating deeper economic weakness than anticipated. This has direct implications for Bank of England policy and investor confidence in British assets. Which central banks are most influential in current forex movements? The Federal Reserve , European Central Bank , and Bank of England are driving major currency pairs through their policy decisions and economic outlook statements. How do currency movements affect cryptocurrency markets? Currency movements influence cryptocurrency markets through several channels: changing risk appetite, capital flows between asset classes, stablecoin dynamics, and institutional positioning across traditional and digital assets. What should traders watch next in forex markets? Traders should monitor upcoming central bank meetings, inflation data releases, and technical levels in major currency pairs. The interaction between traditional forex markets and cryptocurrency valuations remains a key area to watch. Conclusion: Navigating the Shifting Financial Landscape The simultaneous dollar weekly loss and sterling weakens scenario reveals deeper currents in global financial markets. For cryptocurrency participants, these traditional market movements offer both warning signals and opportunity indicators. The UK’s GDP drop serves as a reminder that economic fundamentals still drive market outcomes, even as digital assets create new valuation paradigms. Successful navigation of this environment requires understanding how currency movements in the forex market interact with digital asset valuations, creating a complex but potentially rewarding trading landscape for those who can read the signals across both traditional and emerging financial systems. To learn more about the latest forex market trends, explore our articles on key developments shaping currency movements and their implications for cross-asset trading strategies in both traditional and digital markets. This post Dollar Weekly Loss Reveals Market Turmoil: Sterling Plunges After Shocking GDP Drop first appeared on BitcoinWorld .",
    "tags": "Forex News|Currency|Dollar|Forex|GDP|Sterling",
    "categories": "FIAT|MARKET|TRADING|MACROECONOMICS|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoin World",
      "img": "https://resources.cryptocompare.com/news/82/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680069",
    "guid": "https://news.bitcoin.com/?p=777276&preview=true&preview_id=777276",
    "published_on": 1765531801,
    "imageurl": "https://resources.cryptocompare.com/news/14/55680069.jpeg",
    "title": "Klarna Partners With Privy to Develop Crypto Wallet Infrastructure",
    "url": "https://news.bitcoin.com/klarna-partners-with-privy-to-develop-crypto-wallet-infrastructure/",
    "source": "bitcoin.com",
    "body": "Flexible payments provider explores crypto wallet solutions with Privy to enable mainstream digital asset adoption for millions of users. Klarna announced a research partnership with Privy on December 11, 2025, aimed at developing wallet solutions for its crypto products, including the recently launched USD stablecoin. The collaboration seeks to make cryptocurrency more accessible to everyday",
    "tags": "News Bytes|News Bytes - 5|Stablecoin|Stripe|Wallets",
    "categories": "RESEARCH|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoin.com",
      "img": "https://images.cryptocompare.com/news/default/bitcoincom.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680349",
    "guid": "https://www.cryptopolitan.com/?p=876805",
    "published_on": 1765531800,
    "imageurl": "https://resources.cryptocompare.com/news/43/55680349.jpeg",
    "title": "This New Crypto Under $0.04 Is Breaking Through 95% Allocation, Can It Become the Next 15x Winner?",
    "url": "https://www.cryptopolitan.com/this-new-crypto-under-0-04-is-breaking-through-95-allocation-can-it-become-the-next-15x-winner/",
    "source": "cryptopolitan",
    "body": "A new altcoin priced under $0.04 is climbing 95% allocation at a rapid rate, and investors are following it. As the momentum is gaining, and significant milestones of major developments are going to be reached, many are wondering whether Mutuum Finance (MUTM) may become one of the next big crypto gainers in the 2026 cycle. What Mutuum Finance (MUTM) Is Building Mutuum Finance is constructing an entrusting protocol of decentralization, based on twolinked rates. Within the Peer to Contract market, the users borrow ETH or USDT. They are awarded mtTokens which are appreciated as the borrower’s service interests. This enables the lenders to have the APY with respect to the actual usage of the platform. Under the Peer to Peer market, the borrowers establish direct contracts with the lenders. Liquidity in interest rates. Borrowing will remain affordable in conditions of strong liquidity. In the case of tightening of liquidity, the rate increases. Collateral protection is through loan to value limits. In case collateral becomes too low, liquidation takes place. A liquidator makes payments on a loan and gets subordinated collateral. This dual form is useful in maintaining a stable movement of borrowing under various market circumstances. Mutuum Finance has been in very good initial momentum. The project indicates fundraising of $19.250M and 18,500 holders. The size of the user base is important to lending protocols since the depth of liquidity and the size of the community response is a factor in establishing the stability of the behaviour over the long term and the potential to be utilized. The team established the V1 testnet will be available in Q4 2025. V1 will comprise the lending pool, mtTokens, liquidation mechanisms and the debt engine. Lending of ETH and USDT will be accepted. Price Activity and Increasing Allocation Pressure Mutuum Finance (MUTM) presale launched at $0.01 in early 2025 in the market. It is currently priced at $0.035, with a 250% increase. The total supply amounts to 4 billion of MUTM, and 1.82 billion or 45.5% of these tokens are distributed through presale phases. As of now, 815M tokens were bought. The project is now in the Phase 6 that is already more than 95% allocated. The amount of supply at this level is minimal. The stage 7 will introduce it by a close to 20% MUTM appreciation, which will move the token nearer to its official launch value of $0.06. Phase 1 buyers are set to see 500% MUTM growth at that point. Such stage based increments are important to early movers. After Phase 6, the cost of entry will shift upwards. As the allocation is fast, this was being perceived as one of the few opportunities that traders have to enter before the price realigns. Layers of Security: CertiK and Halborn The project has a significant concern on security. Mutuum Finance was audited by CertiK, with 90/100 points in a Token Scan. The audit was used to review behavior of contracts, and logic of transfer and general risk exposure. Halborn Security is undertaking a more intense examination of the lending contracts. This involves testing of interest computations, liquidation guidelines, collateral handling and communication between the various system components. Halborn plays the task of ensuring that the lending engine performs safely in various cases of liquidity. Among the key factors that traders consider in the most promising options, security plays a significant role in the evaluation of Mutuum Finance as a strong early entrant. Protocols of DeFi are based on very specific mechanics and audit systems contribute to the development of user trust. Time Runs out with Allocation Reduction According to reports of Mutuum Finance, Phase 6 gains momentum on a daily basis. Buyers are responding to the last pricing window with less than 5% left before the next price increment. The latest whale allocation of over $90K lessened the supply further and put more strain. The 24 hour leaderboard helps in high activity of the community. The best contributor of each day receives $500 in MUTM. This aids in the preservation of consistent engagement even in the quieter market conditions. Onboarding is easy with card payments support, and it has contributed to increasing the number of users who are new to DeFi. Being an Ethereum based project, Scaling tools would be compatible with Mutuum Finance in the future. Early stage assets with high utility and development milestones are favored by investors trying to find the best crypto assets to invest in even before 2026. As V1 is coming up soon, and the allocation has nearly in the past, Mutuum Finance is entering one of its most significant periods of growth. This point is regarded by a large number of traders who follow the predictions of cryptos as the possible turning point before the visibility broadens. For more information about Mutuum Finance (MUTM) visit the links below: Website: https://www.mutuum.com Linktree: https://linktr.ee/mutuumfinance",
    "tags": "Press Release",
    "categories": "BLOCKCHAIN|ETH|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Cryptopolitan",
      "img": "https://images.cryptocompare.com/news/default/cryptopolitan.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.704839"
  },
  {
    "id": "55680552",
    "guid": "https://en.coinotag.com/coinbase-may-launch-prediction-markets-and-tokenized-stocks-via-december-livestream",
    "published_on": 1765531742,
    "imageurl": "https://resources.cryptocompare.com/news/77/55680552.jpeg",
    "title": "Coinbase May Launch Prediction Markets and Tokenized Stocks via December Livestream",
    "url": "https://en.coinotag.com/coinbase-may-launch-prediction-markets-and-tokenized-stocks-via-december-livestream",
    "source": "coinotag",
    "body": "Coinbase is set to launch prediction markets and tokenized equities next week via a livestream, following its membership in a coalition with Kalshi and other US operators. This move expands the largest US crypto exchange's offerings into event-based trading and asset tokenization, aiming to democratize financial access. Coinbase joins Coalition for Prediction Markets with Kalshi [...]",
    "tags": "News",
    "categories": "EXCHANGE|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55680046",
    "guid": "https://coinpaper.com/13071/cftc-scraps-actual-delivery-crypto-playbook-from-2020",
    "published_on": 1765531670,
    "imageurl": "https://resources.cryptocompare.com/news/93/default.png",
    "title": "CFTC Scraps “Actual Delivery” Crypto Playbook From 2020",
    "url": "https://coinpaper.com/13071/cftc-scraps-actual-delivery-crypto-playbook-from-2020",
    "source": "coinpaper",
    "body": "The CFTC pulled its 2020 staff guidance on “actual delivery,” a key test that can decide whether some retail crypto trades fall under futures-style rules. CFTC withdraws “actual delivery” crypto guidance it issued in 2020 The Commodity Futures Trading Commission has withdrawn staff guidance that explained how the agency interpreted “actual delivery” for retail commodity transactions involving “virtual currencies,” a standard that can determine whether a crypto trade falls under futures-style regulation. Acting Chairman Caroline D. Pham said on Dec. 11, 2025, that the agency pulled the guidance because crypto markets have changed since it was released and because the prior framework had become outdated and overly complex. The announcement points to broader CFTC work tied to federal digital-asset policy recommendations, and it says the agency may later consider updated guidance or FAQs while inviting public engagement through its Crypto Sprint. Why “actual delivery” still drives how some retail crypto trades get regulated The “actual delivery” concept matters because US law treats certain margined, leveraged, or financed retail commodity transactions “as if” they were futures contracts unless they qualify for the actual-delivery exception. That exception can keep a transaction out of futures-style rules when delivery occurs within the required time window. In March 2020, the CFTC issued final interpretive guidance focused on retail commodity transactions in virtual currency, describing two main factors it considered when deciding whether actual delivery occurred. Those factors centered on whether the customer obtained possession and control of the full amount purchased and whether the seller and any counterparties kept residual interests or control that undercut delivery. The CFTC ’s Dec. 11 withdrawal removes that specific 2020 staff guidance from the agency’s active playbook, but it does not erase the underlying statutory framework that makes “actual delivery” a key dividing line for certain retail crypto products.",
    "tags": "News|Legal",
    "categories": "COMMODITY|MARKET|REGULATION|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Coinpaper",
      "img": "https://resources.cryptocompare.com/news/93/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55680143",
    "guid": "https://cryptopotato.com/?p=1423034",
    "published_on": 1765531625,
    "imageurl": "https://images.cryptocompare.com/news/default/cryptopotato.png",
    "title": "Ripple Secures Breakthrough Banking Adoption in Europe: Details",
    "url": "https://cryptopotato.com/ripple-secures-breakthrough-banking-adoption-in-europe-details/",
    "source": "cryptopotato",
    "body": "The blockchain-based financial tech company has notched a fresh partnership with AMINA Bank AG to support near real-time cross-border payments for the latter’s clients using Ripple Payments. AMINA Bank’s CPO noted that native web3 businesses often run into friction when working with legacy banking systems, which is why the organization believes instant cross-border payments are necessary. Ripple Payments’ integration into AMINA Bank’s operations will allow the latter’s clients to reduce the friction typically arising between blockchain and traditional banking rails. It will enable its customers to move funds seamlessly and settle transactions more efficiently without relying on traditional payment infrastructure. This should make transactions faster, while also reducing costs, and would increase reliability and transparency. Through our licensed payments technology, we are providing a crucial bridge between fiat and blockchain rails to AMINA Bank’s clients, giving them access to seamless payments using Ripple USD (RLUSD) and other stablecoins, as well as the ability to make rapid payouts in multiple currencies. AMINA Bank embodies the forward-thinking approach needed to advance wider adoption of digital assets technology, and we’re proud to support them in serving their clients with the most secure, resilien,t and compliant digital asset technology on the market,” commented Cassie Craddock, Managing Director, UK & Europe at Ripple. It’s worth noting that this collaboration builds on a previous one between the two parties, as AMINA Bank became the first such institution globally to support Ripple’s native stablecoin, RLUSD. AMINA Bank was founded in Zug, Switzerland, in April 2018 and categorizes itself as a “pioneer in the crypto banking industry.” It received the Swiss Banking and Securities Dealer License from the Swiss Financial Market Supervisory Authority (FINMA) in 2019. The post Ripple Secures Breakthrough Banking Adoption in Europe: Details appeared first on CryptoPotato .",
    "tags": "AA News|Crypto News|Banks|Ripple",
    "categories": "BLOCKCHAIN|FIAT|MARKET|TECHNOLOGY|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Crypto Potato",
      "img": "https://images.cryptocompare.com/news/default/cryptopotato.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679913",
    "guid": "https://bitcoinworld.co.in/?p=244212",
    "published_on": 1765531511,
    "imageurl": "https://resources.cryptocompare.com/news/82/default.png",
    "title": "Northern Trust MicroStrategy Stock Move: A $260M Bet on Bitcoin’s Future",
    "url": "https://bitcoinworld.co.in/northern-trust-microstrategy-stock-holdings/",
    "source": "bitcoinworld",
    "body": "BitcoinWorld Northern Trust MicroStrategy Stock Move: A $260M Bet on Bitcoin’s Future In a powerful signal of institutional confidence, trust banking titan Northern Trust has revealed a massive $260 million position in MicroStrategy stock. This move, reported by BitcoinTreasuries.NET, isn’t just about a single company—it’s a strategic, indirect bet on the future of Bitcoin itself. Let’s unpack what this Northern Trust MicroStrategy stock holding truly means for the evolving financial landscape. What Does Northern Trust’s $260M MicroStrategy Bet Mean? Northern Trust, a cornerstone of traditional finance with over $1.5 trillion in assets under custody, now holds 1.488 million shares of MicroStrategy (MSTR). This is significant because MicroStrategy’s primary corporate strategy is to acquire and hold Bitcoin on its balance sheet. Therefore, when a firm like Northern Trust invests heavily in MSTR, it is effectively gaining exposure to Bitcoin’s price performance through an equity vehicle. This provides a regulated, familiar pathway for institutional capital to flow into the crypto ecosystem. Why Are Giants Like Northern Trust Choosing This Path? Institutions face regulatory and operational hurdles when buying Bitcoin directly. Investing in a publicly-traded company like MicroStrategy offers a clever workaround. It allows them to participate in Bitcoin’s potential upside without navigating crypto custody, security, or complex accounting rules head-on. For Northern Trust, this MicroStrategy stock position represents a calculated, low-friction entry point into digital assets. Regulatory Clarity: Equities are a well-understood asset class with clear reporting standards. Operational Simplicity: No need for private key management or specialized crypto custodians. Liquidity: MSTR shares can be traded easily on traditional stock exchanges. The Ripple Effect of Major Northern Trust MicroStrategy Stock Holdings This isn’t an isolated event. It’s part of a broader trend of institutional adoption. When a venerable institution like Northern Trust makes such a move, it acts as a beacon for other conservative capital allocators. It validates the thesis that Bitcoin is a legitimate store of value and a viable component of a modern treasury strategy. This endorsement can drive further investment, increasing overall market stability and maturity. What Are the Potential Challenges and Risks? However, this strategy is not without its nuances. The investment carries dual layers of risk: the performance of MicroStrategy as a business and the volatility of Bitcoin’s price. Furthermore, it’s an indirect exposure. Shareholders do not own the underlying Bitcoin directly, and the stock price of MSTR can sometimes trade at a premium or discount to the value of its Bitcoin holdings. Investors must understand they are betting on the company’s execution of its Bitcoin strategy as much as on Bitcoin itself. Actionable Insights for Observers and Investors For the crypto market, the growing list of institutions holding MicroStrategy stock is a bullish long-term indicator. It demonstrates sustained, sophisticated demand. For individual investors, it highlights the importance of understanding the different avenues for crypto exposure—from direct purchase to ETFs and equity proxies like MSTR. Monitoring filings for changes in Northern Trust’s MicroStrategy stock position can also serve as a valuable sentiment gauge. Conclusion: A Landmark Endorsement for Digital Assets The revelation of Northern Trust’s substantial MicroStrategy stock holding is a landmark moment. It transcends a simple portfolio update, representing a profound shift in how traditional finance perceives and accesses Bitcoin. This $260 million vote of confidence from a trusted guardian of wealth underscores Bitcoin’s accelerating journey from niche digital token to a mainstream institutional asset. The walls between old finance and new are becoming more permeable by the day. Frequently Asked Questions (FAQs) Q: Why would Northern Trust buy MicroStrategy stock instead of Bitcoin directly? A> Buying MicroStrategy stock allows Northern Trust to gain Bitcoin exposure through a familiar, regulated public equity, avoiding the direct custody and regulatory complexities of holding the cryptocurrency itself. Q: How much Bitcoin exposure does this $260M investment represent? A> The exposure is indirect and based on MicroStrategy’s total Bitcoin holdings relative to its market cap. It gives Northern Trust a fractional claim on the Bitcoin owned by MicroStrategy’s corporate treasury. Q: Is this a common strategy for other big institutions? A> Yes. Several hedge funds, asset managers, and even other corporations have used MicroStrategy stock as a proxy to gain regulated exposure to Bitcoin’s price movement. Q: Does this mean Northern Trust is bullish on Bitcoin? A> While it’s an investment in a company, MicroStrategy’s value is heavily tied to its Bitcoin strategy. A large investment in MSTR is widely interpreted as a bullish signal on Bitcoin’s long-term value proposition. Q: What are the risks of this indirect investment approach? A> Risks include MicroStrategy’s business performance beyond Bitcoin, potential tracking error between MSTR’s stock price and Bitcoin’s value, and the overall volatility of the crypto market. Found this analysis of Northern Trust’s major crypto move insightful? Share this article on Twitter or LinkedIn to spark a conversation about the future of institutional finance and cryptocurrency! To learn more about the latest Bitcoin trends, explore our article on key developments shaping Bitcoin institutional adoption. This post Northern Trust MicroStrategy Stock Move: A $260M Bet on Bitcoin’s Future first appeared on BitcoinWorld .",
    "tags": "Crypto News|BITCOIN|BLOCKCHAIN|CRYPTOCURRENCY|Finance|Institutional Investment",
    "categories": "BTC|BUSINESS|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoin World",
      "img": "https://resources.cryptocompare.com/news/82/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679898",
    "guid": "https://coinpaper.com/13070/600-m-xrp-shifted-in-minutes-as-toxr-etf-launch-sparks-whale-activity",
    "published_on": 1765531475,
    "imageurl": "https://resources.cryptocompare.com/news/93/default.png",
    "title": "600M XRP Shifted in Minutes as TOXR ETF Launch Sparks Whale Activity",
    "url": "https://coinpaper.com/13070/600-m-xrp-shifted-in-minutes-as-toxr-etf-launch-sparks-whale-activity",
    "source": "coinpaper",
    "body": "XRP trades near $2.03 after dropping 15.7% over the last 30 days, and this decline shapes the backdrop for a sudden rise in whale activity that caught the market’s attention. The XRP Ledger recorded seven large transfers that settled within minutes, and the precision of the movements raised questions about institutional intentions and liquidity planning. A tweet highlighted the shift first through a post that spread quickly among analysts. His update showed seven wallets each receiving 100 million XRP. Four sending wallets connected to Ripple-linked accounts, while three other addresses did not match any known cluster. This mix of recognized and unknown participants created interest across the monitoring community. On-Chain Evidence of Coordinated Movement Trusted explorers show each transfer moving exactly 100 million XRP. The transactions settled inside a narrow window, and the timing signaled a coordinated plan. Retail users rarely move funds with this level of precision, so analysts examined the structure carefully to understand its purpose. The movements raised logical questions because such alignment usually reflects internal planning or institutional flows. Four wallets in the transfer wave linked directly to Ripple activity. These wallets often handle liquidity management, settlement support, or internal reorganization. Ripple conducts large movements during treasury planning cycles, and this latest sequence aligned with previous operational adjustments. The transfers reflected structured positioning rather than any market-facing action. Unknown Wallets Add New Suspense Three wallets in the group did not match any recognized entity. These addresses held no prior links to exchanges, custodians, or OTC desks . Analysts tracked their behavior because synchronized allocation often signals new strategic participants. These wallets created speculation about fresh institutional entry or new custodial frameworks preparing for ecosystem involvement. Market Reaction and Liquidity Tracking The market watched XRP price behavior closely as the transfers settled. Large movements often influence sentiment because liquidity conditions shift quickly when major addresses reorganize their holdings. Traders monitored exchange inflows to check for any sign of potential activity that could affect short-term volatility. The community also tracked whether the seven wallets would reveal any new patterns that point toward broader operational use. Insights from On-Chain Treasury Review A deeper on-chain review uncovered a structured treasury operation inside Ripple’s wallet framework. Ripple funded six new wallets with 100 million XRP each, which totaled 600 million XRP. Two source wallets drained completely during this process, which signaled a controlled redistribution across smaller internal units. Ripple divided the holdings into tranches that can support future deployments across various corporate needs. Source: X Context from the TOXR ETF Launch The timing aligned with a major ecosystem milestone. The 21Shares XRP ETF (TOXR) launched on the Cboe BZX Exchange after the SEC declared the issuer’s S-1 effective. The ETF tracks the CME CF XRP-Dollar Reference Rate and uses a 0.3% sponsor fee. Executives at 21Shares said U.S. investors continue to request wider access to crypto products with strong regulatory structure, and demand for XRP exposure has climbed steadily. XRP-backed ETFs in the U.S. already crossed $1 billion in cumulative inflows before this launch, and the new listing may increase competition among issuers. What Analysts Monitor Next Analysts continue to track all seven wallets for new transfers. Any movement toward exchanges may create fresh signals about near-term liquidity behavior. Clustering patterns may also reveal whether the unknown addresses relate to Ripple’s internal structure or new institutional actors. The synchronized 100 million XRP transactions illustrate strategic preparation during a key moment for XRP as ETF expansion, institutional interest, and on-chain restructuring converge.",
    "tags": "News|Crypto",
    "categories": "REGULATION|XRP|DIGITAL ASSET TREASURY|MACROECONOMICS|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Coinpaper",
      "img": "https://resources.cryptocompare.com/news/93/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679995",
    "guid": "https://en.coinotag.com/breakingnews/bnb-chain-spotlight-cz-and-dragonverse-forge-on-chain-dragon-ball-ip-growth-at-abu-dhabi-hackathon",
    "published_on": 1765531466,
    "imageurl": "https://resources.cryptocompare.com/news/77/55679995.jpeg",
    "title": "BNB Chain Spotlight: CZ and DragonVerse Forge On-Chain Dragon Ball IP Growth at Abu Dhabi Hackathon",
    "url": "https://en.coinotag.com/breakingnews/bnb-chain-spotlight-cz-and-dragonverse-forge-on-chain-dragon-ball-ip-growth-at-abu-dhabi-hackathon",
    "source": "coinotag",
    "body": "BNB Chain Spotlight: CZ and DragonVerse Forge On-Chain Dragon Ball IP Growth at Abu Dhabi Hackathon",
    "tags": "Breaking News",
    "categories": "BNB|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55680539",
    "guid": "https://invezz.com/?p=2999188",
    "published_on": 1765531404,
    "imageurl": "https://resources.cryptocompare.com/news/69/default.png",
    "title": "XRP holds support around a key level, eyes $2.3; Check forecast",
    "url": "https://invezz.com/news/2025/12/12/xrp-holds-support-around-a-key-level-eyes-2-3-check-forecast/",
    "source": "invezz",
    "body": "The cryptocurrency market has bounced back from the post-FOMC slump, with Bitcoin hitting the $93k level a few hours ago. Leading altcoins such as Ether and XRP are also in the green. Ripple’s XRP is up by more than 1% and could rally higher in the near term after defending the $1.9 support level once",
    "tags": "Altcoins|Crypto|XRP",
    "categories": "ALTCOIN|BTC|MARKET|XRP|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Invezz",
      "img": "https://resources.cryptocompare.com/news/69/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679993",
    "guid": "https://en.coinotag.com/breakingnews/binance-futures-launches-usdt-paired-perpetual-contracts-ususdt-40x-and-cysusdt-20x-on-december-12-2025",
    "published_on": 1765531254,
    "imageurl": "https://resources.cryptocompare.com/news/77/55679993.jpeg",
    "title": "Binance Futures Launches USDT-Paired Perpetual Contracts: USUSDT 40x and CYSUSDT 20x on December 12, 2025",
    "url": "https://en.coinotag.com/breakingnews/binance-futures-launches-usdt-paired-perpetual-contracts-ususdt-40x-and-cysusdt-20x-on-december-12-2025",
    "source": "coinotag",
    "body": "Binance Futures Launches USDT-Paired Perpetual Contracts: USUSDT 40x and CYSUSDT 20x on December 12, 2025",
    "tags": "Breaking News",
    "categories": "EXCHANGE|ZRX|BNB|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679914",
    "guid": "https://cointelegraph.com/news/coinbase-prediction-markets-tokenized-stocks-december-17-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "published_on": 1765531229,
    "imageurl": "https://images.cryptocompare.com/news/default/cointelegraph.png",
    "title": "Coinbase may debut prediction markets, tokenized stocks on Wednesday: Report",
    "url": "https://cointelegraph.com/news/coinbase-prediction-markets-tokenized-stocks-december-17-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "cointelegraph",
    "body": "Coinbase will showcase its new products on a livestream next week after joining a prediction market coalition with Kalshi and other US operators, Bloomberg reported.",
    "tags": "",
    "categories": "EXCHANGE|MARKET|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Cointelegraph",
      "img": "https://images.cryptocompare.com/news/default/cointelegraph.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679991",
    "guid": "https://en.coinotag.com/breakingnews/ranger-token-to-issue-on-metadao-with-6-million-target-ranger-finances-highest-fundraising-milestone-at-solana-breakpoint",
    "published_on": 1765531134,
    "imageurl": "https://resources.cryptocompare.com/news/77/55679991.jpeg",
    "title": "Ranger Token to Issue on MetaDAO with $6 Million Target – Ranger Finance’s Highest Fundraising Milestone at Solana Breakpoint",
    "url": "https://en.coinotag.com/breakingnews/ranger-token-to-issue-on-metadao-with-6-million-target-ranger-finances-highest-fundraising-milestone-at-solana-breakpoint",
    "source": "coinotag",
    "body": "Ranger Token to Issue on MetaDAO with $6 Million Target – Ranger Finance’s Highest Fundraising Milestone at Solana Breakpoint",
    "tags": "Breaking News",
    "categories": "SOL|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679713",
    "guid": "https://thecryptobasic.com/?p=146785",
    "published_on": 1765531057,
    "imageurl": "https://resources.cryptocompare.com/news/65/55679713.jpeg",
    "title": "Ripple CTO Endorses New XRP DeFi Opportunity, Calls It a “Good Thing”",
    "url": "https://thecryptobasic.com/2025/12/12/ripple-cto-endorses-new-xrp-defi-opportunity-calls-it-a-good-thing/",
    "source": "thecryptobasic",
    "body": "Ripple’s CTO, David Schwartz, publicly endorses a major new initiative that expands the presence of XRP across the broader DeFi landscape. Notably, the initiative centers on Hex Trust’s launch of wrapped XRP (wXRP), a fully collateralized, 1:1-backed token. Visit Website",
    "tags": "Market|David Schwartz News|Latest XRP (Ripple) News Today",
    "categories": "MARKET|XRP|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "The Crypto Basic",
      "img": "https://images.cryptocompare.com/news/default/thecryptobasic.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55677374",
    "guid": "https://cryptodaily.co.uk/2025/12/lbank-launches-futures-earn-offering-up-to-25-apr",
    "published_on": 1765531019,
    "imageurl": "https://resources.cryptocompare.com/news/75/55677374.jpeg",
    "title": "LBank Launches Futures Earn, Offering up to 25% APR",
    "url": "https://cryptodaily.co.uk/2025/12/lbank-launches-futures-earn-offering-up-to-25-apr",
    "source": "cryptodaily",
    "body": "Singapore, Singapore, December 12th, 2025, Chainwire LBank , a leading global digital asset trading platform, announced the launch of its new wealth management product Futures Earn which is exclusively available to VIP users, the product offers up to 25% APR, helping them earn additional interest income while keeping trading flexible and improving the capital efficiency and overall returns of their futures accounts. Through Futures Earn, VIP users can allocate a designated portion of their USDT earning assets to their futures accounts, where eligible funds generate daily returns without disrupting normal futures trading. The feature can be switched on or off at any time, allowing futures accounts to benefit from both interest income and trading position gains. Notably, Futures Earn currently supports only USDT earning assets and applies a tiered rate structure: when the futures position value is up to 100,000 USDT, the first 25,000 USDT earns 12% APR and any excess earns 3% APR; when the position value exceeds 100,000 USDT, the first 25,000 USDT can earn up to 25% APR, with any excess still earning 3% APR. This structure offers attractive return potential for users across different asset levels. LBank continues to expand and refine its wealth management offerings, forming a diversified product lineup that includes Locked, Futures Earn, and Dual Investment. To date, the platform has distributed over 46 million USD in earnings to users, with peak annualized returns reaching 64.5%. The launch of Futures Earn strengthens LBank’s futures yield products and highlights its commitment to high-net-worth users and diversified digital asset wealth management. Looking ahead, LBank will continue to innovate in digital asset wealth management, further enriching its suite of yield products and introducing more exclusive, high-value opportunities for VIP users. By combining robust risk management with flexible earning tools, LBank aims to help users achieve sustainable, long-term growth in their digital asset portfolios. About LBank Founded in 2015, LBank is a leading global cryptocurrency exchange serving over 20 million registered users in 160 countries and regions. With a daily trading volume exceeding $10.5 billion and 10 years of safety with zero security incidents, LBank is dedicated to providing a comprehensive and user-friendly trading experience. Through innovative trading solutions, the platform has enabled users to achieve average returns of over 130% on newly listed assets. As the ultimate 100x Gems Hub, LBank has listed over 300 mainstream coins and more than 50 high-potential gems. Ranked No. 1 in 100x Gems, Highest Gains, and Meme Share, LBank leads the market with the fastest altcoin listings, unmatched liquidity, and industry-first trading guarantees, making it the go-to platform for crypto investors worldwide. Follow LBank for Updates Website: https://www.lbank.com/ Twitter: https://twitter.com/LBank_Exchange Telegram: https://t.me/LBank_en Instagram: https://www.instagram.com/lbank_exchange LinkedIn: https://www.linkedin.com/company/lbank Contact PR & Communications TeamLBankpress@lbank.com Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.",
    "tags": "More News",
    "categories": "SPONSORED|TRADING|USDT|ZRX|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Crypto Daily",
      "img": "https://resources.cryptocompare.com/news/75/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679835",
    "guid": "https://cointelegraph.com/news/standard-chartered-capital-a-ringgit-stablecoin-malaysia?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "published_on": 1765530983,
    "imageurl": "https://images.cryptocompare.com/news/default/cointelegraph.png",
    "title": "Standard Chartered, AirAsia parent to test ringgit stablecoin in Malaysia",
    "url": "https://cointelegraph.com/news/standard-chartered-capital-a-ringgit-stablecoin-malaysia?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "cointelegraph",
    "body": "Standard Chartered Malaysia and AirAsia parent Capital A plan to issue and test a ringgit-pegged stablecoin for wholesale applications.",
    "tags": "",
    "categories": "OTHER",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Cointelegraph",
      "img": "https://images.cryptocompare.com/news/default/cointelegraph.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679655",
    "guid": "https://u.today/shiba-inu-shib-saved-crucial-shiba-inu-price-bounce-keeps-uptrend-alive",
    "published_on": 1765530900,
    "imageurl": "https://resources.cryptocompare.com/news/64/55679655.jpeg",
    "title": "Crucial Shiba Inu Price Bounce Keeps Uptrend Alive",
    "url": "https://u.today/shiba-inu-shib-saved-crucial-shiba-inu-price-bounce-keeps-uptrend-alive",
    "source": "utoday",
    "body": "Shiba inu is coming back to a bullish state as the price of the asset makes an important comeback.",
    "tags": "Shiba Inu",
    "categories": "SHIB|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "U.Today",
      "img": "https://images.cryptocompare.com/news/default/utoday.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679561",
    "guid": "https://coinpaper.com/13069/xrp-shows-resilience-inverted-hammer-sparks-bullish-hope-based-on-a-potential-bottom",
    "published_on": 1765530840,
    "imageurl": "https://resources.cryptocompare.com/news/93/default.png",
    "title": "XRP Shows Resilience: Inverted Hammer Sparks Bullish Hope Based on a Potential Bottom",
    "url": "https://coinpaper.com/13069/xrp-shows-resilience-inverted-hammer-sparks-bullish-hope-based-on-a-potential-bottom",
    "source": "coinpaper",
    "body": "XRP Shows Signs of Consolidation Ahead of Key Levels Market analyst CryptoCeek notes that XRP is coiling under its 20‑day EMA, with bears unable to trigger a decisive breakdown, hinting at a potential buildup for its next move. XRP is at a key technical juncture, testing critical support and resistance zones. A reclaim of $2.12 could fuel a bullish push toward $2.26, where the downtrend line offers a prime target, signaling renewed buyer control and attracting momentum traders and institutional attention. Conversely, failure to hold $1.98 may trigger a slide toward lower channel support, with $1.61 as the next key level. Such a move would mark a short-term bearish phase, prompting traders and investors to reassess risk and positioning. Therefore, XRP is at a pivotal juncture. Breaking above $2.12 could ignite short-term buying interest, while slipping below $1.98 may trigger profit-taking or defensive repositioning. XRP Weekly Charts Show Potential Bottom: Inverted Hammer Signals Possible Reversal Renowned market expert EGRAG CRYPTO highlights that XRP may be forming a bottom after weeks of decline. The weekly $1.94 candle produced a classic inverted hammer, a strong bullish reversal signal, indicating easing selling pressure and potential buyer momentum after a multi-week downtrend. The inverted hammer is a bullish signal, but confirmation is crucial before declaring a trend reversal. EGRAG CRYPTO identifies key conditions for XRP to validate a potential bottom: Strong Green Weekly Close: A follow-up bullish candle signals growing buyer momentum. Higher Low Formation: Establishing a higher low confirms stronger support and reduced downside risk. Break Above Key Resistance: Clearing the $2.10–$2.20 zone, and ideally surpassing $2.30, strengthens the case for a bullish reversal. XRP is currently trading at $2.03, just above the inverted hammer’s low, signaling buyers are probing for upward momentum. While promising, this pattern remains a tentative bottom until key confirmation levels are met. Well, the inverted hammer signals renewed hope for XRP bulls after weeks of consolidation below key moving averages. A strong weekly close above $2.20–$2.30 could spark a broader recovery, drawing both retail and institutional interest. Conclusion XRP is at a pivotal juncture, with bulls targeting $2.12 for a breakout and bears defending $1.98. The next sessions will likely set the short-term trend, with $2.26 as the upside target and $1.61 as key support. Additionally, XRP’s weekly inverted hammer at $1.94 signals a potential bottom, but confirmation is key. As a result, a keen eye should be given to higher lows, sustained bullish momentum, and resistance breaks to validate a reversal. The coming weeks will be decisive, as XRP sits at a critical inflection point shaping its short-term trajectory.",
    "tags": "News|Ripple",
    "categories": "BUSINESS|MARKET|TRADING|XRP|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Coinpaper",
      "img": "https://resources.cryptocompare.com/news/93/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679586",
    "guid": "https://cryptopotato.com/?p=1423007",
    "published_on": 1765530745,
    "imageurl": "https://resources.cryptocompare.com/news/27/55679586.jpeg",
    "title": "YouTube Enables PayPal Stablecoin Payments for Content Creators",
    "url": "https://cryptopotato.com/youtube-enables-paypal-stablecoin-payments-for-content-creators/",
    "source": "cryptopotato",
    "body": "YouTube has enabled PayPal stablecoin (PYSUD) payments to US-based content creators. PayPal’s head of crypto, May Zabaneh, confirmed the arrangement to Fortune on Friday. YouTube will not be handling crypto and will let PayPal do the work on its behalf, added Zabaneh. “The beauty of what we’ve built is that YouTube doesn’t have to touch crypto, and so we can help take away that complexity,” Google also confirmed the move to the outlet but did not elaborate with further details. paypal’s pyusd, issued by @Paxos , now available for youtube creator payouts pic.twitter.com/MYFK3KQSes — Mike Dudas (@mdudas) December 12, 2025 Stablecoin Payment Landscape Growing YouTube already uses PayPal services to help large enterprises pay gig workers and contractors, it stated. “The creator economy is worth over $250 billion and growing fast. Routing even a fraction of that through stablecoins changes everything,” commented ‘ChainIsle’. Earlier this year, PayPal added the capability for payment recipients to receive their pay in PYUSD, the centralized stablecoin it launched in 2023. PYUSD has grown since then to become the world’s sixth-largest stablecoin with a market capitalization of $3.9 billion. Its supply is more than a billion dollars, more than the Trump family’s World Liberty Finance stablecoin, USD1. The fintech firm has been integrating the stablecoin across its products, including Venmo, merchant payments, and vendor payouts. Google Cloud has also previously accepted PYUSD payments from customers. In July, PayPal launched “Pay with Crypto,” allowing merchants to accept payments in over 100 cryptocurrencies with automatic conversion to stablecoins or fiat currency. PayPal also rolled out peer-to-peer crypto transfers in September, allowing users to send Bitcoin, Ethereum, and PYUSD to friends, family, and external wallets using shareable links. Stablecoin Ecosystem Outlook The total market capitalization for stablecoins is at record highs of over $300 billion, according to crypto analytics platforms. It represents around 10% of the entire crypto market capitalization, according to CoinGecko, and there has been huge growth in 2025, following the passage of the GENIUS Act in the US. Tether remains the dominant industry player with 60% market share, while PayPal’s PYUSD is just 1.2% despite recent growth . The post YouTube Enables PayPal Stablecoin Payments for Content Creators appeared first on CryptoPotato .",
    "tags": "AA News|Crypto News|PayPal|Stablecoins",
    "categories": "BTC|ETH|MARKET|PYUSD|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Crypto Potato",
      "img": "https://images.cryptocompare.com/news/default/cryptopotato.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679466",
    "guid": "https://thecryptobasic.com/?p=146761",
    "published_on": 1765530666,
    "imageurl": "https://resources.cryptocompare.com/news/65/55679466.jpeg",
    "title": "YouTube Rolls Out PYUSD Stablecoin Payments for U.S. Creators",
    "url": "https://thecryptobasic.com/2025/12/12/youtube-rolls-out-pyusd-stablecoin-payments-for-u-s-creators/",
    "source": "thecryptobasic",
    "body": "YouTube has introduced a new payout option for creators in the United States, allowing them to receive their earnings in PayPal’s dollar-backed stablecoin, PYUSD. The move introduces a new dimension to YouTube’s monetization framework. Visit Website",
    "tags": "Market|Latest Stablecoin News Today",
    "categories": "MARKET|PYUSD",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "The Crypto Basic",
      "img": "https://images.cryptocompare.com/news/default/thecryptobasic.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679494",
    "guid": "https://en.coin-turk.com/?p=208674",
    "published_on": 1765530631,
    "imageurl": "https://resources.cryptocompare.com/news/79/55679494.jpeg",
    "title": "Hyperliquid Sees Dynamic Shifts in Price and Market Activity",
    "url": "https://en.coin-turk.com/hyperliquid-sees-dynamic-shifts-in-price-and-market-activity/",
    "source": "cointurken",
    "body": "HYPE faced dynamic market activity with fluctuations between $27 and $30. Whale movements and increased open interest indicate potential for ongoing volatility. Continue Reading: Hyperliquid Sees Dynamic Shifts in Price and Market Activity The post Hyperliquid Sees Dynamic Shifts in Price and Market Activity appeared first on COINTURK NEWS .",
    "tags": "Hyperliquid (HYPE)",
    "categories": "MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinTurk News",
      "img": "https://resources.cryptocompare.com/news/79/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679429",
    "guid": "https://bitcoinworld.co.in/?p=244208",
    "published_on": 1765530611,
    "imageurl": "https://resources.cryptocompare.com/news/82/default.png",
    "title": "TYCOON Token Soars 83% After Stunning Buyback Announcement",
    "url": "https://bitcoinworld.co.in/tycoon-token-buyback-surge/",
    "source": "bitcoinworld",
    "body": "BitcoinWorld TYCOON Token Soars 83% After Stunning Buyback Announcement In a dramatic market move, the TYCOON token has skyrocketed over 80% following a major announcement from the Dino Tycoon project. This AI-powered Web3 game revealed plans to use operating profits for a strategic TYCOON token buyback, sending shockwaves through the gaming cryptocurrency sector. Let’s explore what this means for investors and the project’s future. What Sparked the TYCOON Token Price Surge? The Dino Tycoon team made a crucial announcement through their official X account that immediately impacted the market. They revealed that a portion of their Season 1 operating profits would fund a TYCOON token buyback program. This strategic decision demonstrates the project’s commitment to token value and investor confidence. According to CoinMarketCap data, the TYCOON token surged an impressive 83.3% following the announcement, reaching $0.05497. This dramatic increase shows how market participants respond positively to concrete value-building measures rather than empty promises. How Does the TYCOON Token Buyback Program Work? The TYCOON token buyback initiative represents a significant development in Web3 gaming economics. The project plans to complete the first buyback before year-end, creating immediate buying pressure in the market. More importantly, they’ve committed to continuing this practice in future seasons. This approach offers several key benefits: Reduced circulating supply – Fewer tokens available can increase scarcity Demonstrated profitability – Operating profits fund the buyback Sustained value support – Ongoing commitment across multiple seasons Investor confidence boost – Team aligns incentives with token holders What’s Next for Dino Tycoon and the TYCOON Token? The project has announced that Season 2 will launch in the third week of December, creating additional excitement around the TYCOON token. This regular content update schedule combined with the buyback program creates a compelling value proposition for both gamers and investors. However, investors should consider several factors. While the TYCOON token buyback provides short-term price support, long-term value depends on continued game development, user adoption, and sustainable revenue generation. The Web3 gaming space remains competitive, and execution will determine ultimate success. Why This TYCOON Token Move Matters for Web3 Gaming The Dino Tycoon approach represents a maturation in Web3 gaming economics. Instead of relying solely on speculation or new user acquisition, they’re using actual operating profits to support token value. This creates a healthier ecosystem where success benefits all participants. Other gaming projects may follow this TYCOON token buyback model if it proves successful. The key innovation here is the commitment to allocate “a portion of operating profits” regularly, creating predictable buy pressure that could stabilize and potentially increase token value over time. Conclusion: A Bold Step Forward for Gaming Cryptocurrencies The TYCOON token’s dramatic surge demonstrates how concrete, well-communicated value propositions can move markets. Dino Tycoon’s buyback program, funded by actual operating profits, represents a significant development in Web3 gaming tokenomics. While short-term volatility may continue, this strategic move aligns project success with token holder value in a meaningful way. As Season 2 approaches in December, all eyes will be on whether the TYCOON token can maintain its momentum and whether the buyback program delivers sustained value. This case serves as an important example of how gaming projects can build trust through transparent, investor-friendly policies. Frequently Asked Questions What is a token buyback? A token buyback occurs when a project uses its funds to purchase its own tokens from the open market, reducing circulating supply and potentially increasing value. How will the TYCOON token buyback affect price? Buybacks create buying pressure and reduce available tokens, which typically supports or increases prices, though market conditions and other factors also influence outcomes. When will the first TYCOON token buyback happen? The Dino Tycoon team stated the first buyback will be completed before the end of the current year. Will there be more TYCOON token buybacks? Yes, the project plans to continue allocating a portion of operating profits to buybacks in subsequent seasons. What is Dino Tycoon? Dino Tycoon is an AI-based Web3 simulation game where the TYCOON token serves as the native cryptocurrency for in-game transactions and rewards. When does Season 2 start? The next season is scheduled to begin in the third week of December according to the project announcement. Found this analysis of the TYCOON token buyback helpful? Share this article with fellow crypto enthusiasts and Web3 gaming investors on your social media channels to spread the knowledge! To learn more about the latest gaming cryptocurrency trends, explore our article on key developments shaping blockchain gaming and tokenomics. This post TYCOON Token Soars 83% After Stunning Buyback Announcement first appeared on BitcoinWorld .",
    "tags": "Crypto News|BLOCKCHAIN|CRYPTOCURRENCY|Gaming|Tokenomics|Web3",
    "categories": "BLOCKCHAIN|BUSINESS|MARKET|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Bitcoin World",
      "img": "https://resources.cryptocompare.com/news/82/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679989",
    "guid": "https://en.coinotag.com/solanas-rwa-pivot-may-ease-2025-bearish-pressures",
    "published_on": 1765530607,
    "imageurl": "https://resources.cryptocompare.com/news/77/55679989.jpeg",
    "title": "Solana’s RWA Pivot May Ease 2025 Bearish Pressures",
    "url": "https://en.coinotag.com/solanas-rwa-pivot-may-ease-2025-bearish-pressures",
    "source": "coinotag",
    "body": "Solana (SOL) has experienced a 27% year-to-date decline in 2025, marking its worst performance among top cryptocurrencies since the 2022 bear market. Despite bearish price action, the ecosystem is shifting toward real-world assets (RWAs) through key partnerships, potentially driving future utility and adoption. Solana's price has fallen 27% in 2025, underperforming peers like BNB, which [...]",
    "tags": "News",
    "categories": "MARKET|SOL|TRADING|BNB|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679430",
    "guid": "https://thecryptobasic.com/?p=146799",
    "published_on": 1765530526,
    "imageurl": "https://resources.cryptocompare.com/news/65/55679430.jpeg",
    "title": "Jake Claver Predicts XRP Still Has Room for a 100X Explosion",
    "url": "https://thecryptobasic.com/2025/12/12/jake-claver-predicts-xrp-still-has-room-for-a-100x-explosion/",
    "source": "thecryptobasic",
    "body": "Digital Ascension Group CEO Jake Claver continues to maintain his widely projected triple-digit price outlook for XRP. On the latest Good Evening Crypto podcast, host Abs highlighted this prediction and noted that analysts are closely watching Japan. Visit Website",
    "tags": "Market|Latest XRP (Ripple) News Today|XRP Price Prediction",
    "categories": "ASIA|MARKET|XRP|ZRX|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "The Crypto Basic",
      "img": "https://images.cryptocompare.com/news/default/thecryptobasic.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679355",
    "guid": "https://en.coinotag.com/breakingnews/solana-genesis-sdk-debuts-at-breakpoint-powering-trading-platform-launchpads-with-fair-distribution-tokens",
    "published_on": 1765530349,
    "imageurl": "https://resources.cryptocompare.com/news/77/55679355.jpeg",
    "title": "Solana Genesis SDK Debuts at Breakpoint, Powering Trading Platform Launchpads with Fair-Distribution Tokens",
    "url": "https://en.coinotag.com/breakingnews/solana-genesis-sdk-debuts-at-breakpoint-powering-trading-platform-launchpads-with-fair-distribution-tokens",
    "source": "coinotag",
    "body": "Solana Genesis SDK Debuts at Breakpoint, Powering Trading Platform Launchpads with Fair-Distribution Tokens",
    "tags": "Breaking News",
    "categories": "SOL|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679511",
    "guid": "307dbb1a-20cb-4e54-ad1f-8072ae66e7b9",
    "published_on": 1765530276,
    "imageurl": "https://resources.cryptocompare.com/news/5/55679511.jpeg",
    "title": "Standard Chartered, Coinbase Expand Crypto Prime Services for Institutions",
    "url": "https://www.coindesk.com/business/2025/12/12/standard-chartered-coinbase-expand-crypto-prime-services-for-institutions",
    "source": "coindesk",
    "body": "The companies will explore the development of trading, prime services, custody, staking and lending solutions for institutional clients.",
    "tags": "Finance|Coinbase|Standard chartered|Singapore|News",
    "categories": "ASIA|EXCHANGE|TRADING|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinDesk",
      "img": "https://resources.cryptocompare.com/news/5/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679354",
    "guid": "https://en.coinotag.com/breakingnews/btc-og-insider-whale-opens-20x-leveraged-sol-long-on-solana-250000-sol-worth-34-44m-with-89k-unrealized-profit",
    "published_on": 1765530216,
    "imageurl": "https://resources.cryptocompare.com/news/77/55679354.jpeg",
    "title": "BTC OG Insider Whale Opens 20x Leveraged SOL Long on Solana: 250,000 SOL Worth $34.44M with $89K Unrealized Profit",
    "url": "https://en.coinotag.com/breakingnews/btc-og-insider-whale-opens-20x-leveraged-sol-long-on-solana-250000-sol-worth-34-44m-with-89k-unrealized-profit",
    "source": "coinotag",
    "body": "BTC OG Insider Whale Opens 20x Leveraged SOL Long on Solana: 250,000 SOL Worth $34.44M with $89K Unrealized Profit",
    "tags": "Breaking News",
    "categories": "BTC|BUSINESS|SOL|ZRX|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "CoinOtag",
      "img": "https://resources.cryptocompare.com/news/77/default.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679161",
    "guid": "https://finbold.com/?p=259019",
    "published_on": 1765530134,
    "imageurl": "https://images.cryptocompare.com/news/default/finbold.png",
    "title": "Binance introduces IOI feature to improve institutional crypto trading efficiency",
    "url": "https://finbold.com/binance-introduces-ioi-feature-to-improve-institutional-crypto-trading-efficiency/",
    "source": "finbold",
    "body": "Binance has launched a new Indication of Interest (IOI) feature for spot trading and fixed-rate crypto loans, so that institutional clients can execute large transactions with reduced market impact. The new Binance Spot and Loan IOI is designed for qualified users and allows them to privately signal buy, sell, borrow, or lend intentions without placing binding orders on public order books. The feature targets one of the long-standing challenges in crypto markets: executing large trades without triggering price slippage or exposing sensitive trading intentions. New feature brings tools that prioritize liquidity and efficiency In traditional financial markets, institutional traders often rely on IOIs to gauge liquidity while minimizing disruption. Binance’s implementation introduces a similar mechanism for digital assets , particularly for mid- and small-cap tokens, where liquidity can be more limited. Through Spot IOI, users can indicate interest in buying or selling sizable crypto positions at specific price levels without obligation. Loan IOI integrates with Binance’s fixed-rate loan infrastructure, allowing institutional borrowers and lenders to tailor loan terms based on their capital needs. By submitting IOIs via Binance’s OTC & Execution Services, institutional participants gain early visibility into available liquidity and can engage counterparties through private negotiations, reducing the risk of adverse price movements during execution. Catherine Chen, Head of VIP & Institutional at Binance, said of the launch: “Binance continues to lead the development of institutional crypto trading by delivering tools that prioritize liquidity and efficiency. Our Indication of Interest feature is pioneering for a crypto exchange, aligning with TradFi standards and meeting the sophisticated requirements of institutional traders who need to execute large transactions.” The IOI launch follows recent upgrades to Binance’s OTC & Execution Desk, including enhanced quote sourcing from multiple liquidity providers to improve spreads, pricing, and execution speed. The exchange said the new feature is part of its broader effort to support increasing institutional participation in digital asset markets. Featured image via Shutterstock. The post Binance introduces IOI feature to improve institutional crypto trading efficiency appeared first on Finbold .",
    "tags": "Cryptocurrency news|Binance|crypto|crypto trading|cryptocurrency|institusional investing",
    "categories": "EXCHANGE|MARKET|TRADING|BNB|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "Finbold",
      "img": "https://images.cryptocompare.com/news/default/finbold.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55679163",
    "guid": "https://ambcrypto.com/?p=553041",
    "published_on": 1765530045,
    "imageurl": "https://images.cryptocompare.com/news/default/ambcrypto.png",
    "title": "Solana sinks 27% YTD – How SOL’s RWA push keeps FOMO alive",
    "url": "https://ambcrypto.com/solana-sinks-27-ytd-how-sols-rwa-push-keeps-fomo-alive/",
    "source": "ambcrypto",
    "body": "From speculation to RWAs: Can Solana’s pivot reignite demand?",
    "tags": "Altcoin|News|News 1|Social|Solana|Trading View|ambcrypto",
    "categories": "ALTCOIN|SOL|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "AMB Crypto",
      "img": "https://images.cryptocompare.com/news/default/ambcrypto.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  },
  {
    "id": "55680801",
    "guid": "https://www.newsbtc.com/?p=866105",
    "published_on": 1765530032,
    "imageurl": "https://resources.cryptocompare.com/news/21/55680801.jpeg",
    "title": "Do Kwon Falls Hard — Terraform Labs Chief Gets 15 Years For Wire Fraud",
    "url": "https://www.newsbtc.com/altcoin/do-kwon-falls-hard-terraform-labs-chief-gets-15-years-for-wire-fraud/",
    "source": "newsbtc",
    "body": "Do Kwon, the South Korean co-founder of Terraform Labs, was sentenced to 15 years in prison on December 11, 2025 in a Manhattan federal court after pleading guilty to fraud tied to the collapse of the TerraUSD stablecoin and its sister token, Luna. Related Reading: Is Dogecoin Waking Up? Critical On-Chain Metric Explodes Higher According to court documents and news reports, the judge described the scheme as a massive fraud that left thousands of investors facing heavy losses. Sentence And Court Ruling Judge Paul A. Engelmayer handed down the 15-year term after prosecutors urged for a sentence of up to 12 years and the defense asked for a much lighter term. Do Kwon pleaded guilty in August 2025 to conspiracy to defraud and wire fraud, and as part of the plea he agreed to forfeit roughly $19 million. The US Attorney’s office says the guilty plea admits he misled investors about how the stablecoin kept its $1 peg. Scale Of The Losses Reports have placed the market fallout from the Terra collapse at about $40 billion in erased value. Many ordinary investors lost life savings and some victims gave emotional testimony at sentencing, describing real financial ruin. News outlets and court filings tie the crash in May 2022 to a sudden loss of confidence that cascaded through markets and hurt other crypto firms. Civil Penalties And Settlements Before the criminal case reached this point, Kwon and Terraform faced a major civil action from the US Securities and Exchange Commission. According to the SEC, Terraform Labs and Kwon agreed to pay more than $4.5 billion in disgorgement, interest and penalties, while Kwon personally faced an $80 million civil fine and a ban from crypto trading. That civil judgment was filed in 2024 and has been used by regulators as part of the overall effort to make investors whole. International Arrest And Extradition Kwon was arrested in Montenegro in March 2023 after leaving Singapore; authorities say he was using forged travel documents when detained. He fought extradition in Montenegrin courts but was eventually transferred to the US late in 2024 to face federal charges. Reports outline a long legal fight across borders that ended with his return to New York to answer criminal counts. Related Reading: American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack What The Sentence Means Legal analysts say a 15-year term signals the court’s view that the fraud caused wide damage and that punishment should deter similar schemes. Victims’ statements at sentencing appear to have weighed heavily. Kwon still faces separate probes and possible charges in other countries, and the civil judgment means substantial sums are earmarked for recovery efforts tied to Terraform’s bankruptcy. Featured image from Getty Images, chart from TradingView",
    "tags": "Altcoin|Do Kwon|stablecoin|Terraform Labs|TerraUSD",
    "categories": "ALTCOIN|BUSINESS|LUNA|REGULATION|CRYPTOCURRENCY",
    "upvotes": "0",
    "downvotes": "0",
    "lang": "EN",
    "source_info": {
      "name": "NewsBTC",
      "img": "https://images.cryptocompare.com/news/default/newsbtc.png",
      "lang": "EN"
    },
    "platform": "cryptocompare",
    "fetched_at": "2025-12-12T15:04:58.705444"
  }
]